{
  "ir_version": "0.7.0",
  "reflection_enabled": true,
  "app_id": "0d0e2358-ffc7-4f3f-bc89-1af5ca363b1f",
  "name": "Agent Chatbot",
  "description": "Conversational AI chatbot with message history",
  "auth": {
    "provider": "stub",
    "scopes": [
      "chat.use"
    ],
    "roles": [
      {
        "name": "anonymous",
        "scopes": [
          "chat.use"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "messages",
        "snake": "messages",
        "pascal": "Messages"
      },
      "fields": [
        {
          "name": "role",
          "display_name": "role",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "user",
            "assistant"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": "\"user\"",
          "confidentiality_scopes": []
        },
        {
          "name": "body",
          "display_name": "body",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "message",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "compute audit log reply",
        "snake": "compute_audit_log_reply",
        "pascal": "ComputeAuditLogReply"
      },
      "fields": [
        {
          "name": "compute_name",
          "display_name": "compute name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "invocation_id",
          "display_name": "invocation id",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trigger",
          "display_name": "trigger",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "completed_at",
          "display_name": "completed at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "duration_ms",
          "display_name": "duration ms",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "outcome",
          "display_name": "outcome",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "success",
            "error",
            "timeout",
            "cancelled"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_input_tokens",
          "display_name": "total input tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_output_tokens",
          "display_name": "total output tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trace",
          "display_name": "trace",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "error_message",
          "display_name": "error message",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "compute_audit_log_reply",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "none",
      "dependent_values": []
    }
  ],
  "access_grants": [
    {
      "content": "messages",
      "scope": "chat.use",
      "verbs": [
        "CREATE",
        "VIEW"
      ]
    },
    {
      "content": "compute_audit_log_reply",
      "scope": "chat.use",
      "verbs": [
        "AUDIT"
      ]
    },
    {
      "content": "compute_audit_log_reply",
      "scope": "chat.use",
      "verbs": [
        "VIEW"
      ]
    }
  ],
  "state_machines": [],
  "events": [],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/messages",
      "kind": "LIST",
      "content_ref": "messages",
      "required_scope": "chat.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/messages",
      "kind": "CREATE",
      "content_ref": "messages",
      "required_scope": "chat.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/messages/{id}",
      "kind": "GET_ONE",
      "content_ref": "messages",
      "required_scope": "chat.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/messages/{id}",
      "kind": "UPDATE",
      "content_ref": "messages",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/messages/{id}",
      "kind": "DELETE",
      "content_ref": "messages",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_reply",
      "kind": "LIST",
      "content_ref": "compute_audit_log_reply",
      "required_scope": "chat.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_reply/{id}",
      "kind": "GET_ONE",
      "content_ref": "compute_audit_log_reply",
      "required_scope": "chat.use",
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Chat",
      "slug": "chat",
      "role": "anonymous",
      "required_scope": null,
      "children": [
        {
          "type": "chat",
          "props": {
            "source": "messages",
            "role_field": "role",
            "content_field": "body"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "subscribe",
              "props": {
                "content": "messages"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Chat",
      "page_slug": "chat",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    }
  ],
  "streams": [],
  "computes": [
    {
      "name": {
        "display": "reply",
        "snake": "reply",
        "pascal": "Reply"
      },
      "shape": "NONE",
      "input_content": [],
      "output_content": [],
      "body_lines": [],
      "required_scope": "chat.use",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": "ai-agent",
      "preconditions": [],
      "postconditions": [],
      "directive": "You are a helpful conversational assistant. Be natural and\n    helpful. Never fabricate information. If asked to do something\n    outside your capabilities, explain what you can do instead.",
      "objective": "Reply to the user's latest message. Load the conversation\n    history with content.query(\"messages\"). Create your reply\n    with content.create(\"messages\", {\"role\": \"assistant\",\n    \"body\": your_reply}).",
      "strategy": null,
      "trigger": "event \"message.created\"",
      "trigger_where": "message.role == \"user\"",
      "accesses": [
        "messages"
      ],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "actions",
      "audit_scope": "chat.use",
      "audit_content_ref": "compute_audit_log_reply"
    }
  ],
  "channels": [],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}