{
  "ir_version": "0.7.0",
  "reflection_enabled": true,
  "app_id": "2b909f99-d936-4469-843c-2fdc6aceef60",
  "name": "Agent Simple",
  "description": "Minimal AI agent \u2014 submit a prompt, get a completion",
  "auth": {
    "provider": "stub",
    "scopes": [
      "agent.use"
    ],
    "roles": [
      {
        "name": "anonymous",
        "scopes": [
          "agent.use"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "completions",
        "snake": "completions",
        "pascal": "Completions"
      },
      "fields": [
        {
          "name": "prompt",
          "display_name": "prompt",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "response",
          "display_name": "response",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "completion",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "compute audit log complete",
        "snake": "compute_audit_log_complete",
        "pascal": "ComputeAuditLogComplete"
      },
      "fields": [
        {
          "name": "compute_name",
          "display_name": "compute name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "invocation_id",
          "display_name": "invocation id",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trigger",
          "display_name": "trigger",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "completed_at",
          "display_name": "completed at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "duration_ms",
          "display_name": "duration ms",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "outcome",
          "display_name": "outcome",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "success",
            "error",
            "timeout",
            "cancelled"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_input_tokens",
          "display_name": "total input tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_output_tokens",
          "display_name": "total output tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trace",
          "display_name": "trace",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "error_message",
          "display_name": "error message",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "compute_audit_log_complete",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "none",
      "dependent_values": []
    }
  ],
  "access_grants": [
    {
      "content": "completions",
      "scope": "agent.use",
      "verbs": [
        "CREATE",
        "UPDATE",
        "VIEW"
      ]
    },
    {
      "content": "compute_audit_log_complete",
      "scope": "agent.use",
      "verbs": [
        "AUDIT"
      ]
    },
    {
      "content": "compute_audit_log_complete",
      "scope": "agent.use",
      "verbs": [
        "VIEW"
      ]
    }
  ],
  "state_machines": [],
  "events": [],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/completions",
      "kind": "LIST",
      "content_ref": "completions",
      "required_scope": "agent.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/completions",
      "kind": "CREATE",
      "content_ref": "completions",
      "required_scope": "agent.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/completions/{id}",
      "kind": "GET_ONE",
      "content_ref": "completions",
      "required_scope": "agent.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/completions/{id}",
      "kind": "UPDATE",
      "content_ref": "completions",
      "required_scope": "agent.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/completions/{id}",
      "kind": "DELETE",
      "content_ref": "completions",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_complete",
      "kind": "LIST",
      "content_ref": "compute_audit_log_complete",
      "required_scope": "agent.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_complete/{id}",
      "kind": "GET_ONE",
      "content_ref": "compute_audit_log_complete",
      "required_scope": "agent.use",
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Agent",
      "slug": "agent",
      "role": "anonymous",
      "required_scope": "agent.use",
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "completions",
            "columns": [
              {
                "field": "prompt",
                "label": "prompt"
              },
              {
                "field": "response",
                "label": "response"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "subscribe",
              "props": {
                "content": "completions"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        },
        {
          "type": "form",
          "props": {
            "target": "completions",
            "submit_scope": "agent.use"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "prompt",
                "label": "prompt",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Agent",
      "page_slug": "agent",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    }
  ],
  "streams": [],
  "computes": [
    {
      "name": {
        "display": "complete",
        "snake": "complete",
        "pascal": "Complete"
      },
      "shape": "NONE",
      "input_content": [],
      "output_content": [],
      "body_lines": [],
      "required_scope": "agent.use",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": "llm",
      "preconditions": [],
      "postconditions": [],
      "directive": "You are a helpful assistant. Be concise and clear.\n    If you don't know the answer, say so honestly.",
      "objective": "Answer the following prompt from the user.",
      "strategy": null,
      "trigger": "event \"completion.created\"",
      "trigger_where": null,
      "accesses": [
        "completions"
      ],
      "input_fields": [
        [
          "completion",
          "prompt"
        ]
      ],
      "output_fields": [
        [
          "completion",
          "response"
        ]
      ],
      "output_creates": null,
      "audit_level": "actions",
      "audit_scope": "agent.use",
      "audit_content_ref": "compute_audit_log_complete"
    }
  ],
  "channels": [],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}