{
  "ir_version": "0.5.0",
  "reflection_enabled": true,
  "app_id": "2b909f99-d936-4469-843c-2fdc6aceef60",
  "name": "Agent Simple",
  "description": "Minimal AI agent \u2014 submit a prompt, get a completion",
  "auth": {
    "provider": "stub",
    "scopes": [
      "agent.use"
    ],
    "roles": [
      {
        "name": "anonymous",
        "scopes": [
          "agent.use"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "completions",
        "snake": "completions",
        "pascal": "Completions"
      },
      "fields": [
        {
          "name": "prompt",
          "display_name": "prompt",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "response",
          "display_name": "response",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "completion",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": []
    }
  ],
  "access_grants": [
    {
      "content": "completions",
      "scope": "agent.use",
      "verbs": [
        "VIEW"
      ]
    }
  ],
  "state_machines": [],
  "events": [],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/completions",
      "kind": "LIST",
      "content_ref": "completions",
      "required_scope": "agent.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/completions",
      "kind": "CREATE",
      "content_ref": "completions",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/completions/{id}",
      "kind": "GET_ONE",
      "content_ref": "completions",
      "required_scope": "agent.use",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/completions/{id}",
      "kind": "UPDATE",
      "content_ref": "completions",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Agent",
      "slug": "agent",
      "role": "anonymous",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "completions",
            "columns": [
              {
                "field": "prompt",
                "label": "prompt"
              },
              {
                "field": "response",
                "label": "response"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "subscribe",
              "props": {
                "content": "completions"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        },
        {
          "type": "form",
          "props": {
            "target": "completions"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "prompt",
                "label": "prompt",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Agent",
      "page_slug": "agent",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    }
  ],
  "streams": [],
  "computes": [
    {
      "name": {
        "display": "complete",
        "snake": "complete",
        "pascal": "Complete"
      },
      "shape": "NONE",
      "input_content": [],
      "output_content": [],
      "body_lines": [],
      "required_scope": "agent.use",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": "llm",
      "preconditions": [],
      "postconditions": [],
      "directive": "You are a helpful assistant. Be concise and clear.\n    If you don't know the answer, say so honestly.",
      "objective": "Answer the following prompt from the user.",
      "strategy": null,
      "trigger": "event \"completion.created\"",
      "trigger_where": null,
      "accesses": [
        "completions"
      ],
      "input_fields": [
        [
          "completion",
          "prompt"
        ]
      ],
      "output_fields": [
        [
          "completion",
          "response"
        ]
      ],
      "output_creates": null
    }
  ],
  "channels": [],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}