{
  "ir_version": "0.7.0",
  "reflection_enabled": true,
  "app_id": "e4f29a81-6c33-4f2d-b1a9-2c8e5d73f410",
  "name": "Incident Response Hub",
  "description": "Demonstrates all Channel patterns \u2014 data, action, hybrid, streaming, and event-driven sends",
  "auth": {
    "provider": "stub",
    "scopes": [
      "incidents.view",
      "incidents.manage",
      "infra.operate",
      "alerts.send",
      "deploy.read"
    ],
    "roles": [
      {
        "name": "responder",
        "scopes": [
          "incidents.view",
          "incidents.manage",
          "alerts.send"
        ]
      },
      {
        "name": "operator",
        "scopes": [
          "incidents.view",
          "incidents.manage",
          "infra.operate",
          "alerts.send",
          "deploy.read"
        ]
      },
      {
        "name": "viewer",
        "scopes": [
          "incidents.view"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "incidents",
        "snake": "incidents",
        "pascal": "Incidents"
      },
      "fields": [
        {
          "name": "title",
          "display_name": "title",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "severity",
          "display_name": "severity",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "critical",
            "high",
            "medium",
            "low"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "source",
          "display_name": "source",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "affected_service",
          "display_name": "affected service",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "summary",
          "display_name": "summary",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "assigned_to",
          "display_name": "assigned to",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "opened_at",
          "display_name": "opened at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "incident",
      "storage_intent": "auto",
      "has_state_machine": true,
      "initial_state": "opened",
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "deployments",
        "snake": "deployments",
        "pascal": "Deployments"
      },
      "fields": [
        {
          "name": "service",
          "display_name": "service",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "version",
          "display_name": "version",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "commit_sha",
          "display_name": "commit sha",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "deployed_at",
          "display_name": "deployed at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "deployed_by",
          "display_name": "deployed by",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "status",
          "display_name": "status",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "in-progress",
            "succeeded",
            "failed",
            "rolled-back"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "deployment",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "alerts",
        "snake": "alerts",
        "pascal": "Alerts"
      },
      "fields": [
        {
          "name": "monitor_name",
          "display_name": "monitor name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "metric",
          "display_name": "metric",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "threshold",
          "display_name": "threshold",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "current_value",
          "display_name": "current value",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "triggered_at",
          "display_name": "triggered at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "alert",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "compute audit log auto mitigate",
        "snake": "compute_audit_log_auto_mitigate",
        "pascal": "ComputeAuditLogAutoMitigate"
      },
      "fields": [
        {
          "name": "compute_name",
          "display_name": "compute name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "invocation_id",
          "display_name": "invocation id",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trigger",
          "display_name": "trigger",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "completed_at",
          "display_name": "completed at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "duration_ms",
          "display_name": "duration ms",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "outcome",
          "display_name": "outcome",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "success",
            "error",
            "timeout",
            "cancelled"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_input_tokens",
          "display_name": "total input tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_output_tokens",
          "display_name": "total output tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trace",
          "display_name": "trace",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "error_message",
          "display_name": "error message",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "compute_audit_log_auto_mitigate",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "none",
      "dependent_values": []
    }
  ],
  "access_grants": [
    {
      "content": "incidents",
      "scope": "incidents.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "incidents",
      "scope": "incidents.manage",
      "verbs": [
        "CREATE",
        "DELETE",
        "UPDATE"
      ]
    },
    {
      "content": "deployments",
      "scope": "deploy.read",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "deployments",
      "scope": "incidents.manage",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "alerts",
      "scope": "incidents.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "alerts",
      "scope": "incidents.manage",
      "verbs": [
        "CREATE"
      ]
    },
    {
      "content": "compute_audit_log_auto_mitigate",
      "scope": "incidents.manage",
      "verbs": [
        "AUDIT"
      ]
    },
    {
      "content": "compute_audit_log_auto_mitigate",
      "scope": "incidents.manage",
      "verbs": [
        "VIEW"
      ]
    }
  ],
  "state_machines": [
    {
      "content_ref": "incidents",
      "machine_name": "response lifecycle",
      "initial_state": "opened",
      "states": [
        "opened",
        "investigating",
        "mitigating",
        "resolved",
        "closed"
      ],
      "transitions": [
        {
          "from_state": "opened",
          "to_state": "investigating",
          "required_scope": "incidents.manage",
          "feedback": []
        },
        {
          "from_state": "investigating",
          "to_state": "mitigating",
          "required_scope": "incidents.manage",
          "feedback": []
        },
        {
          "from_state": "mitigating",
          "to_state": "resolved",
          "required_scope": "incidents.manage",
          "feedback": []
        },
        {
          "from_state": "resolved",
          "to_state": "closed",
          "required_scope": "incidents.manage",
          "feedback": []
        },
        {
          "from_state": "investigating",
          "to_state": "resolved",
          "required_scope": "incidents.manage",
          "feedback": []
        }
      ],
      "primitive_type": "content"
    }
  ],
  "events": [
    {
      "source_content": "incidents",
      "trigger": "expr",
      "condition": null,
      "action": {
        "target_content": "",
        "column_mapping": [],
        "send_content": "incident",
        "send_channel": "pagerduty"
      },
      "condition_expr": "incident.severity == \"critical\"",
      "log_level": "ERROR"
    },
    {
      "source_content": "incidents",
      "trigger": "expr",
      "condition": null,
      "action": {
        "target_content": "",
        "column_mapping": [],
        "send_content": "incident",
        "send_channel": "slack"
      },
      "condition_expr": "incident.response_lifecycle.enters(\"resolved\")",
      "log_level": "INFO"
    },
    {
      "source_content": "deployments",
      "trigger": "expr",
      "condition": null,
      "action": {
        "target_content": "",
        "column_mapping": [],
        "send_content": "deployment",
        "send_channel": "incident-bus"
      },
      "condition_expr": "deployment.status == \"failed\"",
      "log_level": "WARN"
    }
  ],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/incidents",
      "kind": "LIST",
      "content_ref": "incidents",
      "required_scope": "incidents.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/incidents",
      "kind": "CREATE",
      "content_ref": "incidents",
      "required_scope": "incidents.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/incidents/{id}",
      "kind": "GET_ONE",
      "content_ref": "incidents",
      "required_scope": "incidents.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/incidents/{id}",
      "kind": "UPDATE",
      "content_ref": "incidents",
      "required_scope": "incidents.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/incidents/{id}",
      "kind": "DELETE",
      "content_ref": "incidents",
      "required_scope": "incidents.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/incidents/{id}/_transition/investigating",
      "kind": "TRANSITION",
      "content_ref": "incidents",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "investigating"
    },
    {
      "method": "POST",
      "path": "/api/v1/incidents/{id}/_transition/mitigating",
      "kind": "TRANSITION",
      "content_ref": "incidents",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "mitigating"
    },
    {
      "method": "POST",
      "path": "/api/v1/incidents/{id}/_transition/resolved",
      "kind": "TRANSITION",
      "content_ref": "incidents",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "resolved"
    },
    {
      "method": "POST",
      "path": "/api/v1/incidents/{id}/_transition/closed",
      "kind": "TRANSITION",
      "content_ref": "incidents",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "closed"
    },
    {
      "method": "GET",
      "path": "/api/v1/deployments",
      "kind": "LIST",
      "content_ref": "deployments",
      "required_scope": "deploy.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/deployments",
      "kind": "CREATE",
      "content_ref": "deployments",
      "required_scope": "incidents.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/deployments/{id}",
      "kind": "GET_ONE",
      "content_ref": "deployments",
      "required_scope": "deploy.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/deployments/{id}",
      "kind": "UPDATE",
      "content_ref": "deployments",
      "required_scope": "incidents.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/deployments/{id}",
      "kind": "DELETE",
      "content_ref": "deployments",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/alerts",
      "kind": "LIST",
      "content_ref": "alerts",
      "required_scope": "incidents.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/alerts",
      "kind": "CREATE",
      "content_ref": "alerts",
      "required_scope": "incidents.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/alerts/{id}",
      "kind": "GET_ONE",
      "content_ref": "alerts",
      "required_scope": "incidents.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/alerts/{id}",
      "kind": "UPDATE",
      "content_ref": "alerts",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/alerts/{id}",
      "kind": "DELETE",
      "content_ref": "alerts",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_auto_mitigate",
      "kind": "LIST",
      "content_ref": "compute_audit_log_auto_mitigate",
      "required_scope": "incidents.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_auto_mitigate/{id}",
      "kind": "GET_ONE",
      "content_ref": "compute_audit_log_auto_mitigate",
      "required_scope": "incidents.manage",
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Incident Dashboard",
      "slug": "incident_dashboard",
      "role": "responder",
      "required_scope": "incidents.manage",
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "incidents",
            "columns": [
              {
                "field": "title",
                "label": "title"
              },
              {
                "field": "severity",
                "label": "severity"
              },
              {
                "field": "affected_service",
                "label": "affected service"
              },
              {
                "field": "response_lifecycle",
                "label": "response lifecycle"
              },
              {
                "field": "assigned_to",
                "label": "assigned to"
              },
              {
                "field": "opened_at",
                "label": "opened at"
              }
            ],
            "row_actions": [
              {
                "type": "action_button",
                "props": {
                  "label": "Investigate",
                  "action": "transition",
                  "target_state": "investigating",
                  "visible_when": {
                    "value": ".state.canTransition('investigating')",
                    "is_expr": true
                  },
                  "unavailable_behavior": "disable"
                },
                "style": {},
                "layout": {},
                "children": []
              },
              {
                "type": "action_button",
                "props": {
                  "label": "Mitigate",
                  "action": "transition",
                  "target_state": "mitigating",
                  "visible_when": {
                    "value": ".state.canTransition('mitigating')",
                    "is_expr": true
                  },
                  "unavailable_behavior": "disable"
                },
                "style": {},
                "layout": {},
                "children": []
              },
              {
                "type": "action_button",
                "props": {
                  "label": "Resolve",
                  "action": "transition",
                  "target_state": "resolved",
                  "visible_when": {
                    "value": ".state.canTransition('resolved')",
                    "is_expr": true
                  },
                  "unavailable_behavior": "disable"
                },
                "style": {},
                "layout": {},
                "children": []
              },
              {
                "type": "action_button",
                "props": {
                  "label": "Close",
                  "action": "transition",
                  "target_state": "closed",
                  "visible_when": {
                    "value": ".state.canTransition('closed')",
                    "is_expr": true
                  },
                  "unavailable_behavior": "disable"
                },
                "style": {},
                "layout": {},
                "children": []
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "severity_and_response_lifecycle",
                "mode": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "search",
              "props": {
                "fields": [
                  "title_and_affected_service"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "subscribe",
              "props": {
                "content": "incidents"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        },
        {
          "type": "stat_breakdown",
          "props": {
            "source": "incidents",
            "label": "incidents by severity",
            "group_by": "severity"
          },
          "style": {},
          "layout": {},
          "children": []
        },
        {
          "type": "form",
          "props": {
            "target": "incidents",
            "submit_scope": "incidents.manage"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "title",
                "label": "title",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "severity",
                "label": "severity",
                "input_type": "enum",
                "enum_values": [
                  "critical",
                  "high",
                  "medium",
                  "low"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "affected_service",
                "label": "affected service",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "summary",
                "label": "summary",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "assigned_to",
                "label": "assigned to",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Operations Center",
      "slug": "operations_center",
      "role": "operator",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "alerts",
            "columns": [
              {
                "field": "monitor_name",
                "label": "monitor name"
              },
              {
                "field": "metric",
                "label": "metric"
              },
              {
                "field": "current_value",
                "label": "current value"
              },
              {
                "field": "threshold",
                "label": "threshold"
              },
              {
                "field": "triggered_at",
                "label": "triggered at"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "subscribe",
              "props": {
                "content": "incidents"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        },
        {
          "type": "stat_breakdown",
          "props": {
            "source": "incidents",
            "label": "incidents by severity",
            "group_by": "severity"
          },
          "style": {},
          "layout": {},
          "children": []
        },
        {
          "type": "section",
          "props": {
            "title": "Deployments"
          },
          "style": {},
          "layout": {},
          "children": []
        },
        {
          "type": "section",
          "props": {
            "title": "Alerts"
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    },
    {
      "name": "Incident History",
      "slug": "incident_history",
      "role": "viewer",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "incidents",
            "columns": [
              {
                "field": "title",
                "label": "title"
              },
              {
                "field": "severity",
                "label": "severity"
              },
              {
                "field": "affected_service",
                "label": "affected service"
              },
              {
                "field": "response_lifecycle",
                "label": "response lifecycle"
              },
              {
                "field": "assigned_to",
                "label": "assigned to"
              },
              {
                "field": "opened_at",
                "label": "opened at"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "severity_and_response_lifecycle",
                "mode": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "search",
              "props": {
                "fields": [
                  "title_and_affected_service"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Incidents",
      "page_slug": "incident_dashboard",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    },
    {
      "label": "Operations",
      "page_slug": "operations_center",
      "visible_to": [
        "operator"
      ],
      "badge_content": null
    },
    {
      "label": "History",
      "page_slug": "incident_history",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    }
  ],
  "streams": [],
  "computes": [
    {
      "name": {
        "display": "classify-alert",
        "snake": "classify_alert",
        "pascal": "ClassifyAlert"
      },
      "shape": "TRANSFORM",
      "input_content": [
        "alerts"
      ],
      "output_content": [
        "incidents"
      ],
      "body_lines": [
        "incident.title = alert.monitor_name + \" threshold breached\"",
        "incident.severity = alert.current_value > alert.threshold * 2 ? \"critical\" : alert.current_value > alert.threshold * 1.5 ? \"high\" : \"medium\"",
        "incident.source = \"monitoring\"",
        "incident.affected_service = alert.monitor_name",
        "incident.summary = alert.metric + \" at \" + string(alert.current_value) + \" (threshold: \" + string(alert.threshold) + \")\""
      ],
      "required_scope": "incidents.manage",
      "required_role": null,
      "input_params": [
        {
          "name": "alert",
          "type_name": "alerts"
        }
      ],
      "output_params": [
        {
          "name": "incident",
          "type_name": "incidents"
        }
      ],
      "client_safe": false,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": null,
      "preconditions": [],
      "postconditions": [],
      "directive": null,
      "objective": null,
      "strategy": null,
      "trigger": null,
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "none",
      "audit_scope": null,
      "audit_content_ref": null
    },
    {
      "name": {
        "display": "auto-mitigate",
        "snake": "auto_mitigate",
        "pascal": "AutoMitigate"
      },
      "shape": "TRANSFORM",
      "input_content": [
        "incidents"
      ],
      "output_content": [
        "incidents"
      ],
      "body_lines": [],
      "required_scope": "incidents.manage",
      "required_role": null,
      "input_params": [
        {
          "name": "incident",
          "type_name": "incidents"
        }
      ],
      "output_params": [
        {
          "name": "incident",
          "type_name": "incidents"
        }
      ],
      "client_safe": false,
      "identity_mode": "service",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": "ai-agent",
      "preconditions": [
        "Compute.Scopes.contains(\"incidents.manage\")"
      ],
      "postconditions": [
        "After.content_query(\"incidents\").filter(i, i.response_lifecycle == \"opened\").size() <= Before.content_query(\"incidents\").filter(i, i.response_lifecycle == \"opened\").size()"
      ],
      "directive": null,
      "objective": "You are an incident response agent. For critical and high severity\n    incidents, attempt automated mitigation: restart the affected\n    service, or roll back to the last known-good deployment. For\n    medium and low, just classify and assign.",
      "strategy": "1. Read the incident severity and affected service\n    2. If critical or high:\n       a. Use channel.invoke(\"cloud-provider\", \"restart-service\")\n       b. If restart fails, use channel.invoke(\"cloud-provider\", \"rollback-deployment\")\n       c. Transition to \"mitigating\"\n    3. If medium or low:\n       a. Assign to on-call responder\n       b. Transition to \"investigating\"\n    4. Use channel.invoke(\"slack\", \"post-message\") to notify #incidents",
      "trigger": "event \"incident.created\"",
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "actions",
      "audit_scope": "incidents.manage",
      "audit_content_ref": "compute_audit_log_auto_mitigate"
    }
  ],
  "channels": [
    {
      "name": {
        "display": "github-webhooks",
        "snake": "github_webhooks",
        "pascal": "GithubWebhooks"
      },
      "carries_content": "deployments",
      "direction": "INBOUND",
      "delivery": "RELIABLE",
      "endpoint": null,
      "requirements": [
        {
          "scope": "deploy.read",
          "direction": "send"
        }
      ],
      "actions": []
    },
    {
      "name": {
        "display": "monitoring-feed",
        "snake": "monitoring_feed",
        "pascal": "MonitoringFeed"
      },
      "carries_content": "alerts",
      "direction": "INBOUND",
      "delivery": "REALTIME",
      "endpoint": null,
      "requirements": [
        {
          "scope": "incidents.manage",
          "direction": "send"
        }
      ],
      "actions": []
    },
    {
      "name": {
        "display": "pagerduty",
        "snake": "pagerduty",
        "pascal": "Pagerduty"
      },
      "carries_content": "incidents",
      "direction": "OUTBOUND",
      "delivery": "RELIABLE",
      "endpoint": null,
      "requirements": [
        {
          "scope": "alerts.send",
          "direction": "send"
        }
      ],
      "actions": []
    },
    {
      "name": {
        "display": "cloud-provider",
        "snake": "cloud_provider",
        "pascal": "CloudProvider"
      },
      "carries_content": "",
      "direction": "OUTBOUND",
      "delivery": "RELIABLE",
      "endpoint": null,
      "requirements": [],
      "actions": [
        {
          "name": {
            "display": "restart-service",
            "snake": "restart_service",
            "pascal": "RestartService"
          },
          "takes": [
            {
              "name": "service",
              "param_type": "text"
            },
            {
              "name": "region",
              "param_type": "text"
            }
          ],
          "returns": [
            {
              "name": "status",
              "param_type": "text"
            }
          ],
          "required_scopes": [
            "infra.operate"
          ]
        },
        {
          "name": {
            "display": "scale-service",
            "snake": "scale_service",
            "pascal": "ScaleService"
          },
          "takes": [
            {
              "name": "service",
              "param_type": "text"
            },
            {
              "name": "replicas",
              "param_type": "number"
            }
          ],
          "returns": [
            {
              "name": "status",
              "param_type": "text"
            }
          ],
          "required_scopes": [
            "infra.operate"
          ]
        },
        {
          "name": {
            "display": "rollback-deployment",
            "snake": "rollback_deployment",
            "pascal": "RollbackDeployment"
          },
          "takes": [
            {
              "name": "service",
              "param_type": "text"
            },
            {
              "name": "target version",
              "param_type": "text"
            }
          ],
          "returns": [
            {
              "name": "deployment id",
              "param_type": "text"
            }
          ],
          "required_scopes": [
            "infra.operate"
          ]
        }
      ]
    },
    {
      "name": {
        "display": "slack",
        "snake": "slack",
        "pascal": "Slack"
      },
      "carries_content": "incidents",
      "direction": "BIDIRECTIONAL",
      "delivery": "REALTIME",
      "endpoint": null,
      "requirements": [
        {
          "scope": "incidents.view",
          "direction": "receive"
        }
      ],
      "actions": [
        {
          "name": {
            "display": "post-message",
            "snake": "post_message",
            "pascal": "PostMessage"
          },
          "takes": [
            {
              "name": "channel",
              "param_type": "text"
            },
            {
              "name": "text",
              "param_type": "text"
            }
          ],
          "returns": [
            {
              "name": "ok",
              "param_type": "yes or no"
            }
          ],
          "required_scopes": [
            "alerts.send"
          ]
        },
        {
          "name": {
            "display": "update-status",
            "snake": "update_status",
            "pascal": "UpdateStatus"
          },
          "takes": [
            {
              "name": "channel",
              "param_type": "text"
            },
            {
              "name": "thread",
              "param_type": "text"
            },
            {
              "name": "text",
              "param_type": "text"
            }
          ],
          "returns": [
            {
              "name": "ok",
              "param_type": "yes or no"
            }
          ],
          "required_scopes": [
            "alerts.send"
          ]
        }
      ]
    },
    {
      "name": {
        "display": "incident-bus",
        "snake": "incident_bus",
        "pascal": "IncidentBus"
      },
      "carries_content": "incidents",
      "direction": "INTERNAL",
      "delivery": "AUTO",
      "endpoint": null,
      "requirements": [],
      "actions": []
    }
  ],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}