{
  "ir_version": "0.8.0",
  "reflection_enabled": true,
  "app_id": "b7e1c3a0-4f89-4d1e-a293-8c0d1f6e2b57",
  "name": "Channel Simple",
  "description": "Minimal channel demo with loopback \u2014 outbound channel sends to the app's own inbound webhook, proving the full dispatch pipeline without external services",
  "auth": {
    "provider": "stub",
    "scopes": [
      "messages.all"
    ],
    "roles": [
      {
        "name": "anonymous",
        "scopes": [
          "messages.all"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "notes",
        "snake": "notes",
        "pascal": "Notes"
      },
      "fields": [
        {
          "name": "title",
          "display_name": "title",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "body",
          "display_name": "body",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "note",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "echoes",
        "snake": "echoes",
        "pascal": "Echoes"
      },
      "fields": [
        {
          "name": "title",
          "display_name": "title",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "body",
          "display_name": "body",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "echo",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    }
  ],
  "access_grants": [
    {
      "content": "notes",
      "scope": "messages.all",
      "verbs": [
        "CREATE",
        "DELETE",
        "UPDATE",
        "VIEW"
      ]
    },
    {
      "content": "echoes",
      "scope": "messages.all",
      "verbs": [
        "CREATE",
        "VIEW"
      ]
    }
  ],
  "state_machines": [],
  "events": [
    {
      "source_content": "notes",
      "trigger": "expr",
      "condition": null,
      "action": {
        "target_content": "",
        "column_mapping": [],
        "send_content": "note",
        "send_channel": "note-sync"
      },
      "condition_expr": "note.created",
      "log_level": "INFO"
    }
  ],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/notes",
      "kind": "LIST",
      "content_ref": "notes",
      "required_scope": "messages.all",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/notes",
      "kind": "CREATE",
      "content_ref": "notes",
      "required_scope": "messages.all",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/notes/{id}",
      "kind": "GET_ONE",
      "content_ref": "notes",
      "required_scope": "messages.all",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/notes/{id}",
      "kind": "UPDATE",
      "content_ref": "notes",
      "required_scope": "messages.all",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/notes/{id}",
      "kind": "DELETE",
      "content_ref": "notes",
      "required_scope": "messages.all",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/echoes",
      "kind": "LIST",
      "content_ref": "echoes",
      "required_scope": "messages.all",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/echoes",
      "kind": "CREATE",
      "content_ref": "echoes",
      "required_scope": "messages.all",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/echoes/{id}",
      "kind": "GET_ONE",
      "content_ref": "echoes",
      "required_scope": "messages.all",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/echoes/{id}",
      "kind": "UPDATE",
      "content_ref": "echoes",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/echoes/{id}",
      "kind": "DELETE",
      "content_ref": "echoes",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Notes",
      "slug": "notes",
      "role": "anonymous",
      "required_scope": "messages.all",
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "notes",
            "columns": [
              {
                "field": "title",
                "label": "title"
              },
              {
                "field": "body",
                "label": "body"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "subscribe",
              "props": {
                "content": "notes"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        },
        {
          "type": "form",
          "props": {
            "target": "notes",
            "submit_scope": "messages.all"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "title",
                "label": "title",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "body",
                "label": "body",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Echoes",
      "slug": "echoes",
      "role": "anonymous",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "echoes",
            "columns": [
              {
                "field": "title",
                "label": "title"
              },
              {
                "field": "body",
                "label": "body"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "subscribe",
              "props": {
                "content": "echoes"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Notes",
      "page_slug": "notes",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    },
    {
      "label": "Echoes",
      "page_slug": "echoes",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    }
  ],
  "streams": [],
  "computes": [],
  "channels": [
    {
      "name": {
        "display": "note-sync",
        "snake": "note_sync",
        "pascal": "NoteSync"
      },
      "carries_content": "notes",
      "direction": "OUTBOUND",
      "delivery": "RELIABLE",
      "endpoint": null,
      "requirements": [
        {
          "scope": "messages.all",
          "direction": "send"
        }
      ],
      "actions": []
    },
    {
      "name": {
        "display": "echo-receiver",
        "snake": "echo_receiver",
        "pascal": "EchoReceiver"
      },
      "carries_content": "echoes",
      "direction": "INBOUND",
      "delivery": "RELIABLE",
      "endpoint": null,
      "requirements": [
        {
          "scope": "messages.all",
          "direction": "send"
        }
      ],
      "actions": []
    }
  ],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}