{
  "ir_version": "0.3.0",
  "reflection_enabled": true,
  "app_id": "7bc65103-25fd-43c1-a8b0-7a5905bcc38b",
  "name": "Order Processing Demo",
  "description": "Demonstrates Compute, Channel, and Boundary primitives",
  "auth": {
    "provider": "stub",
    "scopes": [
      "read orders",
      "write orders",
      "admin orders"
    ],
    "roles": [
      {
        "name": "order clerk",
        "scopes": [
          "read orders",
          "write orders"
        ]
      },
      {
        "name": "order manager",
        "scopes": [
          "read orders",
          "write orders",
          "admin orders"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "orders",
        "snake": "orders",
        "pascal": "Orders"
      },
      "fields": [
        {
          "name": "customer",
          "display_name": "customer",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "total",
          "display_name": "total",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "priority",
          "display_name": "priority",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "low",
            "medium",
            "high"
          ],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": true,
      "initial_state": "pending"
    },
    {
      "name": {
        "display": "order lines",
        "snake": "order_lines",
        "pascal": "OrderLines"
      },
      "fields": [
        {
          "name": "parent_order",
          "display_name": "parent order",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "orders",
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "product_name",
          "display_name": "product name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "quantity",
          "display_name": "quantity",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": 1,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "unit_price",
          "display_name": "unit price",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null
    },
    {
      "name": {
        "display": "reports",
        "snake": "reports",
        "pascal": "Reports"
      },
      "fields": [
        {
          "name": "total_count",
          "display_name": "total count",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "total_revenue",
          "display_name": "total revenue",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null
    }
  ],
  "access_grants": [
    {
      "content": "orders",
      "scope": "read orders",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "orders",
      "scope": "write orders",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "orders",
      "scope": "admin orders",
      "verbs": [
        "DELETE"
      ]
    },
    {
      "content": "order_lines",
      "scope": "read orders",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "order_lines",
      "scope": "write orders",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "reports",
      "scope": "read orders",
      "verbs": [
        "VIEW"
      ]
    }
  ],
  "state_machines": [
    {
      "content_ref": "orders",
      "machine_name": "order lifecycle",
      "initial_state": "pending",
      "states": [
        "pending",
        "confirmed",
        "shipped",
        "cancelled"
      ],
      "transitions": [
        {
          "from_state": "pending",
          "to_state": "confirmed",
          "required_scope": "write orders"
        },
        {
          "from_state": "confirmed",
          "to_state": "shipped",
          "required_scope": "write orders"
        },
        {
          "from_state": "pending",
          "to_state": "cancelled",
          "required_scope": "admin orders"
        }
      ],
      "primitive_type": "content"
    }
  ],
  "events": [],
  "routes": [],
  "pages": [
    {
      "name": "Order Dashboard",
      "slug": "order_dashboard",
      "role": "order clerk",
      "required_scope": "write orders",
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "orders",
            "columns": [
              {
                "field": "customer",
                "label": "customer"
              },
              {
                "field": "total",
                "label": "total"
              },
              {
                "field": "priority",
                "label": "priority"
              },
              {
                "field": "status",
                "label": "status"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "priority",
                "mode": "enum",
                "options": [
                  "low",
                  "medium",
                  "high"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "status",
                "mode": "state",
                "options": [
                  "pending",
                  "confirmed",
                  "shipped",
                  "cancelled"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        },
        {
          "type": "form",
          "props": {
            "target": "orders",
            "submit_scope": "write orders"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "customer",
                "label": "customer",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "priority",
                "label": "priority",
                "input_type": "enum",
                "enum_values": [
                  "low",
                  "medium",
                  "high"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Order Analytics",
      "slug": "order_analytics",
      "role": "order manager",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "orders",
            "columns": [
              {
                "field": "customer",
                "label": "customer"
              },
              {
                "field": "total",
                "label": "total"
              },
              {
                "field": "priority",
                "label": "priority"
              },
              {
                "field": "status",
                "label": "status"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Orders",
      "page_slug": "order_dashboard",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    },
    {
      "label": "Analytics",
      "page_slug": "order_analytics",
      "visible_to": [
        "manager"
      ],
      "badge_content": null
    }
  ],
  "streams": [],
  "computes": [
    {
      "name": {
        "display": "calculate order total",
        "snake": "calculate_order_total",
        "pascal": "CalculateOrderTotal"
      },
      "shape": "TRANSFORM",
      "input_content": [
        "orders"
      ],
      "output_content": [
        "orders"
      ],
      "body_lines": [
        "order.total = order.lines.reduce((acc, line) => acc + line.quantity * line.unit_price, 0)"
      ],
      "required_scope": "write orders",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false
    },
    {
      "name": {
        "display": "revenue report",
        "snake": "revenue_report",
        "pascal": "RevenueReport"
      },
      "shape": "REDUCE",
      "input_content": [
        "orders"
      ],
      "output_content": [
        "reports"
      ],
      "body_lines": [
        "report.total_count = orders.length; report.total_revenue = orders.reduce((acc, o) => acc + o.total, 0)"
      ],
      "required_scope": "read orders",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false
    },
    {
      "name": {
        "display": "split order into lines",
        "snake": "split_order_into_lines",
        "pascal": "SplitOrderIntoLines"
      },
      "shape": "EXPAND",
      "input_content": [
        "orders"
      ],
      "output_content": [
        "order_lines"
      ],
      "body_lines": [
        "order.lines.map(line => ({ parent_order: order.id, product_name: line.product_name, quantity: line.quantity, unit_price: line.unit_price }))"
      ],
      "required_scope": "write orders",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false
    },
    {
      "name": {
        "display": "match orders to lines",
        "snake": "match_orders_to_lines",
        "pascal": "MatchOrdersToLines"
      },
      "shape": "CORRELATE",
      "input_content": [
        "orders",
        "order_lines"
      ],
      "output_content": [
        "reports"
      ],
      "body_lines": [
        "orders.join(order_lines, (o, l) => o.id == l.parent_order)"
      ],
      "required_scope": "read orders",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false
    },
    {
      "name": {
        "display": "triage order",
        "snake": "triage_order",
        "pascal": "TriageOrder"
      },
      "shape": "ROUTE",
      "input_content": [
        "orders"
      ],
      "output_content": [
        "orders",
        "reports"
      ],
      "body_lines": [
        "order.priority == \"high\" ? \"orders\" : \"reports\""
      ],
      "required_scope": "write orders",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false
    }
  ],
  "channels": [
    {
      "name": {
        "display": "order webhook",
        "snake": "order_webhook",
        "pascal": "OrderWebhook"
      },
      "carries_content": "orders",
      "direction": "INBOUND",
      "delivery": "RELIABLE",
      "endpoint": "/webhooks/orders",
      "requirements": [
        {
          "scope": "write orders",
          "direction": "send"
        }
      ]
    },
    {
      "name": {
        "display": "order updates stream",
        "snake": "order_updates_stream",
        "pascal": "OrderUpdatesStream"
      },
      "carries_content": "orders",
      "direction": "OUTBOUND",
      "delivery": "REALTIME",
      "endpoint": null,
      "requirements": [
        {
          "scope": "read orders",
          "direction": "receive"
        }
      ]
    },
    {
      "name": {
        "display": "order notifications",
        "snake": "order_notifications",
        "pascal": "OrderNotifications"
      },
      "carries_content": "orders",
      "direction": "BIDIRECTIONAL",
      "delivery": "REALTIME",
      "endpoint": "/ws/orders",
      "requirements": [
        {
          "scope": "read orders",
          "direction": "receive"
        }
      ]
    },
    {
      "name": {
        "display": "internal order bus",
        "snake": "internal_order_bus",
        "pascal": "InternalOrderBus"
      },
      "carries_content": "orders",
      "direction": "INTERNAL",
      "delivery": "AUTO",
      "endpoint": null,
      "requirements": []
    }
  ],
  "boundaries": [
    {
      "name": {
        "display": "order processing",
        "snake": "order_processing",
        "pascal": "OrderProcessing"
      },
      "boundary_type": "application",
      "contains_content": [
        "orders",
        "order_lines",
        "reports"
      ],
      "contains_boundaries": [],
      "identity_mode": "inherit",
      "identity_scopes": [],
      "properties": []
    },
    {
      "name": {
        "display": "order reporting",
        "snake": "order_reporting",
        "pascal": "OrderReporting"
      },
      "boundary_type": "application",
      "contains_content": [
        "reports"
      ],
      "contains_boundaries": [],
      "identity_mode": "restrict",
      "identity_scopes": [
        "read orders"
      ],
      "properties": []
    }
  ],
  "error_handlers": []
}