{
  "ir_version": "0.8.0",
  "reflection_enabled": true,
  "app_id": "7bc65103-25fd-43c1-a8b0-7a5905bcc38b",
  "name": "Order Processing Demo",
  "description": "Demonstrates Compute, Channel, and Boundary primitives",
  "auth": {
    "provider": "stub",
    "scopes": [
      "orders.read",
      "orders.write",
      "orders.admin"
    ],
    "roles": [
      {
        "name": "order clerk",
        "scopes": [
          "orders.read",
          "orders.write"
        ]
      },
      {
        "name": "order manager",
        "scopes": [
          "orders.read",
          "orders.write",
          "orders.admin"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "orders",
        "snake": "orders",
        "pascal": "Orders"
      },
      "fields": [
        {
          "name": "customer",
          "display_name": "customer",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total",
          "display_name": "total",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "priority",
          "display_name": "priority",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "low",
            "medium",
            "high"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "order",
      "storage_intent": "auto",
      "has_state_machine": true,
      "initial_state": "pending",
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "order lines",
        "snake": "order_lines",
        "pascal": "OrderLines"
      },
      "fields": [
        {
          "name": "parent_order",
          "display_name": "parent order",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": "orders",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "product_name",
          "display_name": "product name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "quantity",
          "display_name": "quantity",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": 1,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "unit_price",
          "display_name": "unit price",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "order_line",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "reports",
        "snake": "reports",
        "pascal": "Reports"
      },
      "fields": [
        {
          "name": "total_count",
          "display_name": "total count",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_revenue",
          "display_name": "total revenue",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "report",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "compute audit log calculate order total",
        "snake": "compute_audit_log_calculate_order_total",
        "pascal": "ComputeAuditLogCalculateOrderTotal"
      },
      "fields": [
        {
          "name": "compute_name",
          "display_name": "compute name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "invocation_id",
          "display_name": "invocation id",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trigger",
          "display_name": "trigger",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "completed_at",
          "display_name": "completed at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "duration_ms",
          "display_name": "duration ms",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "outcome",
          "display_name": "outcome",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "success",
            "error",
            "timeout",
            "cancelled"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_input_tokens",
          "display_name": "total input tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_output_tokens",
          "display_name": "total output tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trace",
          "display_name": "trace",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "error_message",
          "display_name": "error message",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "compute_audit_log_calculate_order_total",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "none",
      "dependent_values": []
    },
    {
      "name": {
        "display": "compute audit log revenue report",
        "snake": "compute_audit_log_revenue_report",
        "pascal": "ComputeAuditLogRevenueReport"
      },
      "fields": [
        {
          "name": "compute_name",
          "display_name": "compute name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "invocation_id",
          "display_name": "invocation id",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trigger",
          "display_name": "trigger",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "completed_at",
          "display_name": "completed at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "duration_ms",
          "display_name": "duration ms",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "outcome",
          "display_name": "outcome",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "success",
            "error",
            "timeout",
            "cancelled"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_input_tokens",
          "display_name": "total input tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_output_tokens",
          "display_name": "total output tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trace",
          "display_name": "trace",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "error_message",
          "display_name": "error message",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "compute_audit_log_revenue_report",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "none",
      "dependent_values": []
    }
  ],
  "access_grants": [
    {
      "content": "orders",
      "scope": "orders.read",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "orders",
      "scope": "orders.write",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "orders",
      "scope": "orders.admin",
      "verbs": [
        "DELETE"
      ]
    },
    {
      "content": "order_lines",
      "scope": "orders.read",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "order_lines",
      "scope": "orders.write",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "reports",
      "scope": "orders.read",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "compute_audit_log_calculate_order_total",
      "scope": "orders.admin",
      "verbs": [
        "AUDIT"
      ]
    },
    {
      "content": "compute_audit_log_calculate_order_total",
      "scope": "orders.admin",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "compute_audit_log_revenue_report",
      "scope": "orders.admin",
      "verbs": [
        "AUDIT"
      ]
    },
    {
      "content": "compute_audit_log_revenue_report",
      "scope": "orders.admin",
      "verbs": [
        "VIEW"
      ]
    }
  ],
  "state_machines": [
    {
      "content_ref": "orders",
      "machine_name": "order lifecycle",
      "initial_state": "pending",
      "states": [
        "pending",
        "confirmed",
        "shipped",
        "cancelled"
      ],
      "transitions": [
        {
          "from_state": "pending",
          "to_state": "confirmed",
          "required_scope": "orders.write",
          "feedback": []
        },
        {
          "from_state": "confirmed",
          "to_state": "shipped",
          "required_scope": "orders.write",
          "feedback": []
        },
        {
          "from_state": "pending",
          "to_state": "cancelled",
          "required_scope": "orders.admin",
          "feedback": []
        }
      ],
      "primitive_type": "content"
    }
  ],
  "events": [],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/orders",
      "kind": "LIST",
      "content_ref": "orders",
      "required_scope": "orders.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/orders",
      "kind": "CREATE",
      "content_ref": "orders",
      "required_scope": "orders.write",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/orders/{id}",
      "kind": "GET_ONE",
      "content_ref": "orders",
      "required_scope": "orders.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/orders/{id}",
      "kind": "UPDATE",
      "content_ref": "orders",
      "required_scope": "orders.write",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/orders/{id}",
      "kind": "DELETE",
      "content_ref": "orders",
      "required_scope": "orders.admin",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/orders/{id}/_transition/confirmed",
      "kind": "TRANSITION",
      "content_ref": "orders",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "confirmed"
    },
    {
      "method": "POST",
      "path": "/api/v1/orders/{id}/_transition/shipped",
      "kind": "TRANSITION",
      "content_ref": "orders",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "shipped"
    },
    {
      "method": "POST",
      "path": "/api/v1/orders/{id}/_transition/cancelled",
      "kind": "TRANSITION",
      "content_ref": "orders",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "cancelled"
    },
    {
      "method": "GET",
      "path": "/api/v1/order_lines",
      "kind": "LIST",
      "content_ref": "order_lines",
      "required_scope": "orders.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/order_lines",
      "kind": "CREATE",
      "content_ref": "order_lines",
      "required_scope": "orders.write",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/order_lines/{id}",
      "kind": "GET_ONE",
      "content_ref": "order_lines",
      "required_scope": "orders.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/order_lines/{id}",
      "kind": "UPDATE",
      "content_ref": "order_lines",
      "required_scope": "orders.write",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/order_lines/{id}",
      "kind": "DELETE",
      "content_ref": "order_lines",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/reports",
      "kind": "LIST",
      "content_ref": "reports",
      "required_scope": "orders.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/reports",
      "kind": "CREATE",
      "content_ref": "reports",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/reports/{id}",
      "kind": "GET_ONE",
      "content_ref": "reports",
      "required_scope": "orders.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/reports/{id}",
      "kind": "UPDATE",
      "content_ref": "reports",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/reports/{id}",
      "kind": "DELETE",
      "content_ref": "reports",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_calculate_order_total",
      "kind": "LIST",
      "content_ref": "compute_audit_log_calculate_order_total",
      "required_scope": "orders.admin",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_calculate_order_total/{id}",
      "kind": "GET_ONE",
      "content_ref": "compute_audit_log_calculate_order_total",
      "required_scope": "orders.admin",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_revenue_report",
      "kind": "LIST",
      "content_ref": "compute_audit_log_revenue_report",
      "required_scope": "orders.admin",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_revenue_report/{id}",
      "kind": "GET_ONE",
      "content_ref": "compute_audit_log_revenue_report",
      "required_scope": "orders.admin",
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Order Dashboard",
      "slug": "order_dashboard",
      "role": "order clerk",
      "required_scope": "orders.write",
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "orders",
            "columns": [
              {
                "field": "customer",
                "label": "customer"
              },
              {
                "field": "total",
                "label": "total"
              },
              {
                "field": "priority",
                "label": "priority"
              },
              {
                "field": "status",
                "label": "status"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "priority",
                "mode": "enum",
                "options": [
                  "low",
                  "medium",
                  "high"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "status",
                "mode": "state",
                "options": [
                  "pending",
                  "confirmed",
                  "shipped",
                  "cancelled"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        },
        {
          "type": "form",
          "props": {
            "target": "orders",
            "submit_scope": "orders.write"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "customer",
                "label": "customer",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "priority",
                "label": "priority",
                "input_type": "enum",
                "enum_values": [
                  "low",
                  "medium",
                  "high"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Order Analytics",
      "slug": "order_analytics",
      "role": "order manager",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "orders",
            "columns": [
              {
                "field": "customer",
                "label": "customer"
              },
              {
                "field": "total",
                "label": "total"
              },
              {
                "field": "priority",
                "label": "priority"
              },
              {
                "field": "status",
                "label": "status"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Orders",
      "page_slug": "order_dashboard",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    },
    {
      "label": "Analytics",
      "page_slug": "order_analytics",
      "visible_to": [
        "manager"
      ],
      "badge_content": null
    }
  ],
  "streams": [],
  "computes": [
    {
      "name": {
        "display": "calculate order total",
        "snake": "calculate_order_total",
        "pascal": "CalculateOrderTotal"
      },
      "shape": "TRANSFORM",
      "input_content": [
        "orders"
      ],
      "output_content": [
        "orders"
      ],
      "body_lines": [
        "order.total = order.lines.reduce((acc, line) => acc + line.quantity * line.unit_price, 0)"
      ],
      "required_scope": "orders.write",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": null,
      "preconditions": [],
      "postconditions": [],
      "directive": null,
      "objective": null,
      "strategy": null,
      "trigger": null,
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "actions",
      "audit_scope": "orders.admin",
      "audit_content_ref": "compute_audit_log_calculate_order_total"
    },
    {
      "name": {
        "display": "revenue report",
        "snake": "revenue_report",
        "pascal": "RevenueReport"
      },
      "shape": "REDUCE",
      "input_content": [
        "orders"
      ],
      "output_content": [
        "reports"
      ],
      "body_lines": [
        "report.total_count = orders.length; report.total_revenue = orders.reduce((acc, o) => acc + o.total, 0)"
      ],
      "required_scope": "orders.read",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": null,
      "preconditions": [],
      "postconditions": [],
      "directive": null,
      "objective": null,
      "strategy": null,
      "trigger": null,
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "actions",
      "audit_scope": "orders.admin",
      "audit_content_ref": "compute_audit_log_revenue_report"
    },
    {
      "name": {
        "display": "split order into lines",
        "snake": "split_order_into_lines",
        "pascal": "SplitOrderIntoLines"
      },
      "shape": "EXPAND",
      "input_content": [
        "orders"
      ],
      "output_content": [
        "order_lines"
      ],
      "body_lines": [
        "order.lines.map(line => ({ parent_order: order.id, product_name: line.product_name, quantity: line.quantity, unit_price: line.unit_price }))"
      ],
      "required_scope": "orders.write",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": null,
      "preconditions": [],
      "postconditions": [],
      "directive": null,
      "objective": null,
      "strategy": null,
      "trigger": null,
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "none",
      "audit_scope": null,
      "audit_content_ref": null
    },
    {
      "name": {
        "display": "match orders to lines",
        "snake": "match_orders_to_lines",
        "pascal": "MatchOrdersToLines"
      },
      "shape": "CORRELATE",
      "input_content": [
        "orders",
        "order_lines"
      ],
      "output_content": [
        "reports"
      ],
      "body_lines": [
        "orders.join(order_lines, (o, l) => o.id == l.parent_order)"
      ],
      "required_scope": "orders.read",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": null,
      "preconditions": [],
      "postconditions": [],
      "directive": null,
      "objective": null,
      "strategy": null,
      "trigger": null,
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "none",
      "audit_scope": null,
      "audit_content_ref": null
    },
    {
      "name": {
        "display": "triage order",
        "snake": "triage_order",
        "pascal": "TriageOrder"
      },
      "shape": "ROUTE",
      "input_content": [
        "orders"
      ],
      "output_content": [
        "orders",
        "reports"
      ],
      "body_lines": [
        "order.priority == \"high\" ? \"orders\" : \"reports\""
      ],
      "required_scope": "orders.write",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": null,
      "preconditions": [],
      "postconditions": [],
      "directive": null,
      "objective": null,
      "strategy": null,
      "trigger": null,
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "none",
      "audit_scope": null,
      "audit_content_ref": null
    }
  ],
  "channels": [
    {
      "name": {
        "display": "order webhook",
        "snake": "order_webhook",
        "pascal": "OrderWebhook"
      },
      "carries_content": "orders",
      "direction": "INBOUND",
      "delivery": "RELIABLE",
      "endpoint": "/webhooks/orders",
      "requirements": [
        {
          "scope": "orders.write",
          "direction": "send"
        }
      ],
      "actions": []
    },
    {
      "name": {
        "display": "order updates stream",
        "snake": "order_updates_stream",
        "pascal": "OrderUpdatesStream"
      },
      "carries_content": "orders",
      "direction": "OUTBOUND",
      "delivery": "REALTIME",
      "endpoint": null,
      "requirements": [
        {
          "scope": "orders.read",
          "direction": "receive"
        }
      ],
      "actions": []
    },
    {
      "name": {
        "display": "order notifications",
        "snake": "order_notifications",
        "pascal": "OrderNotifications"
      },
      "carries_content": "orders",
      "direction": "BIDIRECTIONAL",
      "delivery": "REALTIME",
      "endpoint": "/ws/orders",
      "requirements": [
        {
          "scope": "orders.read",
          "direction": "receive"
        }
      ],
      "actions": []
    },
    {
      "name": {
        "display": "internal order bus",
        "snake": "internal_order_bus",
        "pascal": "InternalOrderBus"
      },
      "carries_content": "orders",
      "direction": "INTERNAL",
      "delivery": "AUTO",
      "endpoint": null,
      "requirements": [],
      "actions": []
    }
  ],
  "boundaries": [
    {
      "name": {
        "display": "order processing",
        "snake": "order_processing",
        "pascal": "OrderProcessing"
      },
      "boundary_type": "application",
      "contains_content": [
        "orders",
        "order_lines"
      ],
      "contains_boundaries": [],
      "identity_mode": "inherit",
      "identity_scopes": [],
      "properties": []
    },
    {
      "name": {
        "display": "order reporting",
        "snake": "order_reporting",
        "pascal": "OrderReporting"
      },
      "boundary_type": "application",
      "contains_content": [
        "reports"
      ],
      "contains_boundaries": [],
      "identity_mode": "restrict",
      "identity_scopes": [
        "orders.read"
      ],
      "properties": []
    }
  ],
  "error_handlers": [],
  "reclassification_points": []
}