{
  "ir_version": "0.4.0",
  "reflection_enabled": true,
  "app_id": "c7151224-0ec6-45dd-a5a7-d0e5620f3650",
  "name": "Hello World",
  "description": "The simplest possible Termin application",
  "auth": {
    "provider": "stub",
    "scopes": [],
    "roles": []
  },
  "content": [],
  "access_grants": [],
  "state_machines": [],
  "events": [],
  "routes": [],
  "pages": [
    {
      "name": "Hello",
      "slug": "hello",
      "role": "anonymous",
      "required_scope": null,
      "children": [
        {
          "type": "text",
          "props": {
            "content": "Hello, World"
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    }
  ],
  "nav_items": [],
  "streams": [],
  "computes": [],
  "channels": [],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}