{
  "ir_version": "0.7.0",
  "reflection_enabled": true,
  "app_id": "cb4aef7b-1f54-41a2-8999-55d9367a9304",
  "name": "Hello User",
  "description": "A slightly personalized Hello World.",
  "auth": {
    "provider": "stub",
    "scopes": [
      "app.view"
    ],
    "roles": [
      {
        "name": "Anonymous",
        "scopes": [
          "app.view"
        ]
      },
      {
        "name": "user",
        "scopes": [
          "app.view"
        ]
      }
    ]
  },
  "content": [],
  "access_grants": [],
  "state_machines": [],
  "events": [],
  "routes": [],
  "pages": [
    {
      "name": "Hello",
      "slug": "hello",
      "role": "Anonymous",
      "required_scope": null,
      "children": [
        {
          "type": "text",
          "props": {
            "content": "Anon, Hello!"
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    },
    {
      "name": "Hello",
      "slug": "hello",
      "role": "user",
      "required_scope": null,
      "children": [
        {
          "type": "text",
          "props": {
            "content": {
              "value": "SayHelloTo(User.FirstName)",
              "is_expr": true
            }
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    }
  ],
  "nav_items": [],
  "streams": [],
  "computes": [
    {
      "name": {
        "display": "SayHelloTo",
        "snake": "sayhelloto",
        "pascal": "Sayhelloto"
      },
      "shape": "TRANSFORM",
      "input_content": [
        "text"
      ],
      "output_content": [
        "text"
      ],
      "body_lines": [
        "greeting = \"Hello, \" + name + \"!\""
      ],
      "required_scope": null,
      "required_role": "user",
      "input_params": [
        {
          "name": "name",
          "type_name": "text"
        }
      ],
      "output_params": [
        {
          "name": "greeting",
          "type_name": "text"
        }
      ],
      "client_safe": true,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": null,
      "preconditions": [],
      "postconditions": [],
      "directive": null,
      "objective": null,
      "strategy": null,
      "trigger": null,
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "none",
      "audit_scope": null,
      "audit_content_ref": null
    }
  ],
  "channels": [],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}