{
  "ir_version": "0.3.0",
  "reflection_enabled": true,
  "app_id": "9d81658f-b642-437f-8f39-ffe31faa7701",
  "name": "Help Desk Ticket Tracker",
  "description": "Track support tickets from submission to resolution",
  "auth": {
    "provider": "stub",
    "scopes": [
      "view tickets",
      "create tickets",
      "manage tickets",
      "admin tickets"
    ],
    "roles": [
      {
        "name": "customer",
        "scopes": [
          "view tickets",
          "create tickets"
        ]
      },
      {
        "name": "support agent",
        "scopes": [
          "view tickets",
          "create tickets",
          "manage tickets"
        ]
      },
      {
        "name": "support manager",
        "scopes": [
          "view tickets",
          "create tickets",
          "manage tickets",
          "admin tickets"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "tickets",
        "snake": "tickets",
        "pascal": "Tickets"
      },
      "fields": [
        {
          "name": "title",
          "display_name": "title",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "description",
          "display_name": "description",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "priority",
          "display_name": "priority",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "low",
            "medium",
            "high",
            "critical"
          ],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "category",
          "display_name": "category",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "bug",
            "feature request",
            "question",
            "account issue"
          ],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "submitted_by",
          "display_name": "submitted by",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": "User.Name"
        },
        {
          "name": "assigned_to",
          "display_name": "assigned to",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "created_at",
          "display_name": "created at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": "now"
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": true,
      "initial_state": "open"
    },
    {
      "name": {
        "display": "comments",
        "snake": "comments",
        "pascal": "Comments"
      },
      "fields": [
        {
          "name": "ticket",
          "display_name": "ticket",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "tickets",
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "author",
          "display_name": "author",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": "User.Name"
        },
        {
          "name": "body",
          "display_name": "body",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null
        },
        {
          "name": "posted_at",
          "display_name": "posted at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": "now"
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null
    }
  ],
  "access_grants": [
    {
      "content": "tickets",
      "scope": "view tickets",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "tickets",
      "scope": "create tickets",
      "verbs": [
        "CREATE"
      ]
    },
    {
      "content": "tickets",
      "scope": "manage tickets",
      "verbs": [
        "UPDATE"
      ]
    },
    {
      "content": "tickets",
      "scope": "admin tickets",
      "verbs": [
        "DELETE"
      ]
    },
    {
      "content": "comments",
      "scope": "view tickets",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "comments",
      "scope": "create tickets",
      "verbs": [
        "CREATE"
      ]
    }
  ],
  "state_machines": [
    {
      "content_ref": "tickets",
      "machine_name": "ticket lifecycle",
      "initial_state": "open",
      "states": [
        "open",
        "in progress",
        "waiting on customer",
        "resolved",
        "closed"
      ],
      "transitions": [
        {
          "from_state": "open",
          "to_state": "in progress",
          "required_scope": "manage tickets"
        },
        {
          "from_state": "in progress",
          "to_state": "waiting on customer",
          "required_scope": "manage tickets"
        },
        {
          "from_state": "waiting on customer",
          "to_state": "in progress",
          "required_scope": "create tickets"
        },
        {
          "from_state": "in progress",
          "to_state": "resolved",
          "required_scope": "manage tickets"
        },
        {
          "from_state": "resolved",
          "to_state": "closed",
          "required_scope": "admin tickets"
        },
        {
          "from_state": "resolved",
          "to_state": "in progress",
          "required_scope": "create tickets"
        }
      ],
      "primitive_type": "content"
    }
  ],
  "events": [],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/tickets",
      "kind": "LIST",
      "content_ref": "tickets",
      "required_scope": "view tickets",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/tickets",
      "kind": "CREATE",
      "content_ref": "tickets",
      "required_scope": "create tickets",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/tickets/{id}",
      "kind": "GET_ONE",
      "content_ref": "tickets",
      "required_scope": "view tickets",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/tickets/{id}",
      "kind": "UPDATE",
      "content_ref": "tickets",
      "required_scope": "manage tickets",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/tickets/{id}",
      "kind": "DELETE",
      "content_ref": "tickets",
      "required_scope": "admin tickets",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/tickets/{id}/start",
      "kind": "TRANSITION",
      "content_ref": "tickets",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "in progress"
    },
    {
      "method": "POST",
      "path": "/api/v1/tickets/{id}/wait",
      "kind": "TRANSITION",
      "content_ref": "tickets",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "waiting on customer"
    },
    {
      "method": "POST",
      "path": "/api/v1/tickets/{id}/resolve",
      "kind": "TRANSITION",
      "content_ref": "tickets",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "resolved"
    },
    {
      "method": "POST",
      "path": "/api/v1/tickets/{id}/close",
      "kind": "TRANSITION",
      "content_ref": "tickets",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "closed"
    },
    {
      "method": "POST",
      "path": "/api/v1/tickets/{id}/reopen",
      "kind": "TRANSITION",
      "content_ref": "tickets",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "in progress"
    },
    {
      "method": "GET",
      "path": "/api/v1/comments",
      "kind": "LIST",
      "content_ref": "comments",
      "required_scope": "view tickets",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/comments",
      "kind": "CREATE",
      "content_ref": "comments",
      "required_scope": "create tickets",
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Submit Ticket",
      "slug": "submit_ticket",
      "role": "customer",
      "required_scope": "create tickets",
      "children": [
        {
          "type": "form",
          "props": {
            "target": "tickets",
            "create_as": "open",
            "submit_scope": "create tickets"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "title",
                "label": "title",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "description",
                "label": "description",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "priority",
                "label": "priority",
                "input_type": "enum",
                "enum_values": [
                  "low",
                  "medium",
                  "high",
                  "critical"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "category",
                "label": "category",
                "input_type": "enum",
                "enum_values": [
                  "bug",
                  "feature request",
                  "question",
                  "account issue"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Ticket Queue",
      "slug": "ticket_queue",
      "role": "support agent",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "tickets",
            "columns": [
              {
                "field": "title",
                "label": "title"
              },
              {
                "field": "priority",
                "label": "priority"
              },
              {
                "field": "category",
                "label": "category"
              },
              {
                "field": "status",
                "label": "status"
              },
              {
                "field": "assigned_to",
                "label": "assigned to"
              },
              {
                "field": "created_at",
                "label": "created at"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "highlight",
              "props": {
                "condition": {
                  "value": "priority == \"critical\" || priority == \"high\"",
                  "is_expr": true
                }
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "status",
                "mode": "state",
                "options": [
                  "open",
                  "in progress",
                  "waiting on customer",
                  "resolved",
                  "closed"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "priority",
                "mode": "enum",
                "options": [
                  "low",
                  "medium",
                  "high",
                  "critical"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "category",
                "mode": "enum",
                "options": [
                  "bug",
                  "feature request",
                  "question",
                  "account issue"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "search",
              "props": {
                "fields": [
                  "title",
                  "description"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "subscribe",
              "props": {
                "content": "tickets"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Support Dashboard",
      "slug": "support_dashboard",
      "role": "support manager",
      "required_scope": null,
      "children": [
        {
          "type": "stat_breakdown",
          "props": {
            "source": "tickets",
            "label": "total ticket count with open vs resolved breakdown",
            "group_by": "status"
          },
          "style": {},
          "layout": {},
          "children": []
        },
        {
          "type": "aggregation",
          "props": {
            "source": "comments",
            "label": "total comment count",
            "agg_type": "count"
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Queue",
      "page_slug": "ticket_queue",
      "visible_to": [
        "agent",
        "manager"
      ],
      "badge_content": null
    },
    {
      "label": "Submit",
      "page_slug": "submit_ticket",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    },
    {
      "label": "Dashboard",
      "page_slug": "support_dashboard",
      "visible_to": [
        "manager"
      ],
      "badge_content": null
    }
  ],
  "streams": [
    {
      "description": "ticket updates",
      "path": "/api/v1/stream"
    }
  ],
  "computes": [],
  "channels": [],
  "boundaries": [],
  "error_handlers": []
}