{
  "ir_version": "0.7.0",
  "reflection_enabled": true,
  "app_id": "f98a6e5e-a535-4212-adc4-a6f0e2707e5b",
  "name": "HR Portal",
  "description": "Human Resources management with field-level confidentiality",
  "auth": {
    "provider": "stub",
    "scopes": [
      "employees.view",
      "employees.manage",
      "salary.access",
      "pii.access",
      "team_metrics.view",
      "hr.manage"
    ],
    "roles": [
      {
        "name": "employee",
        "scopes": [
          "employees.view"
        ]
      },
      {
        "name": "manager",
        "scopes": [
          "employees.view",
          "team_metrics.view"
        ]
      },
      {
        "name": "hr business partner",
        "scopes": [
          "employees.view",
          "employees.manage",
          "salary.access",
          "pii.access",
          "team_metrics.view",
          "hr.manage"
        ]
      },
      {
        "name": "executive",
        "scopes": [
          "employees.view",
          "team_metrics.view"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "employees",
        "snake": "employees",
        "pascal": "Employees"
      },
      "fields": [
        {
          "name": "name",
          "display_name": "name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "department",
          "display_name": "department",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "role",
          "display_name": "role",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "start_date",
          "display_name": "start date",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "salary",
          "display_name": "salary",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": [
            "salary.access"
          ]
        },
        {
          "name": "bonus_rate",
          "display_name": "bonus rate",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": [
            "salary.access"
          ]
        },
        {
          "name": "ssn",
          "display_name": "ssn",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": [
            "pii.access"
          ]
        },
        {
          "name": "phone",
          "display_name": "phone",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": [
            "pii.access"
          ]
        },
        {
          "name": "added_by",
          "display_name": "added by",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": "User.Name",
          "confidentiality_scopes": []
        }
      ],
      "singular": "employee",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "departments",
        "snake": "departments",
        "pascal": "Departments"
      },
      "fields": [
        {
          "name": "name",
          "display_name": "name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": true,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "budget",
          "display_name": "budget",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": [
            "salary.access"
          ]
        },
        {
          "name": "head_count",
          "display_name": "head count",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "department",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "salary reviews",
        "snake": "salary_reviews",
        "pascal": "SalaryReviews"
      },
      "fields": [
        {
          "name": "employee",
          "display_name": "employee",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": "employees",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "review_date",
          "display_name": "review date",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "old_salary",
          "display_name": "old salary",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "new_salary",
          "display_name": "new salary",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "reason",
          "display_name": "reason",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "approved_by",
          "display_name": "approved by",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": "User.Name",
          "confidentiality_scopes": []
        },
        {
          "name": "created_at",
          "display_name": "created at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": "now",
          "confidentiality_scopes": []
        }
      ],
      "singular": "salary_review",
      "storage_intent": "auto",
      "has_state_machine": true,
      "initial_state": "pending",
      "confidentiality_scopes": [
        "salary.access"
      ],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "compute audit log calculate team bonus pool",
        "snake": "compute_audit_log_calculate_team_bonus_pool",
        "pascal": "ComputeAuditLogCalculateTeamBonusPool"
      },
      "fields": [
        {
          "name": "compute_name",
          "display_name": "compute name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "invocation_id",
          "display_name": "invocation id",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trigger",
          "display_name": "trigger",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "completed_at",
          "display_name": "completed at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "duration_ms",
          "display_name": "duration ms",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "outcome",
          "display_name": "outcome",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "success",
            "error",
            "timeout",
            "cancelled"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_input_tokens",
          "display_name": "total input tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_output_tokens",
          "display_name": "total output tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trace",
          "display_name": "trace",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "error_message",
          "display_name": "error message",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "none",
      "dependent_values": []
    }
  ],
  "access_grants": [
    {
      "content": "employees",
      "scope": "employees.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "employees",
      "scope": "employees.manage",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "employees",
      "scope": "hr.manage",
      "verbs": [
        "DELETE"
      ]
    },
    {
      "content": "departments",
      "scope": "employees.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "departments",
      "scope": "hr.manage",
      "verbs": [
        "CREATE",
        "DELETE",
        "UPDATE"
      ]
    },
    {
      "content": "salary_reviews",
      "scope": "salary.access",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "salary_reviews",
      "scope": "hr.manage",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "compute_audit_log_calculate_team_bonus_pool",
      "scope": "hr.manage",
      "verbs": [
        "AUDIT"
      ]
    },
    {
      "content": "compute_audit_log_calculate_team_bonus_pool",
      "scope": "hr.manage",
      "verbs": [
        "VIEW"
      ]
    }
  ],
  "state_machines": [
    {
      "content_ref": "salary_reviews",
      "machine_name": "review lifecycle",
      "initial_state": "pending",
      "states": [
        "pending",
        "approved",
        "applied"
      ],
      "transitions": [
        {
          "from_state": "pending",
          "to_state": "approved",
          "required_scope": "hr.manage",
          "feedback": []
        },
        {
          "from_state": "approved",
          "to_state": "applied",
          "required_scope": "hr.manage",
          "feedback": []
        }
      ],
      "primitive_type": "content"
    }
  ],
  "events": [],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/employees",
      "kind": "LIST",
      "content_ref": "employees",
      "required_scope": "employees.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/employees",
      "kind": "CREATE",
      "content_ref": "employees",
      "required_scope": "employees.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/employees/{id}",
      "kind": "GET_ONE",
      "content_ref": "employees",
      "required_scope": "employees.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/employees/{id}",
      "kind": "UPDATE",
      "content_ref": "employees",
      "required_scope": "employees.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/employees/{id}",
      "kind": "DELETE",
      "content_ref": "employees",
      "required_scope": "hr.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/departments",
      "kind": "LIST",
      "content_ref": "departments",
      "required_scope": "employees.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/departments",
      "kind": "CREATE",
      "content_ref": "departments",
      "required_scope": "hr.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/departments/{id}",
      "kind": "GET_ONE",
      "content_ref": "departments",
      "required_scope": "employees.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/departments/{id}",
      "kind": "UPDATE",
      "content_ref": "departments",
      "required_scope": "hr.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/departments/{id}",
      "kind": "DELETE",
      "content_ref": "departments",
      "required_scope": "hr.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/salary_reviews",
      "kind": "LIST",
      "content_ref": "salary_reviews",
      "required_scope": "salary.access",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/salary_reviews",
      "kind": "CREATE",
      "content_ref": "salary_reviews",
      "required_scope": "hr.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/salary_reviews/{id}",
      "kind": "GET_ONE",
      "content_ref": "salary_reviews",
      "required_scope": "salary.access",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/salary_reviews/{id}",
      "kind": "UPDATE",
      "content_ref": "salary_reviews",
      "required_scope": "hr.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/salary_reviews/{id}",
      "kind": "DELETE",
      "content_ref": "salary_reviews",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/salary_reviews/{id}/_transition/approved",
      "kind": "TRANSITION",
      "content_ref": "salary_reviews",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "approved"
    },
    {
      "method": "POST",
      "path": "/api/v1/salary_reviews/{id}/_transition/applied",
      "kind": "TRANSITION",
      "content_ref": "salary_reviews",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "applied"
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_calculate_team_bonus_pool",
      "kind": "LIST",
      "content_ref": "compute_audit_log_calculate_team_bonus_pool",
      "required_scope": "hr.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_calculate_team_bonus_pool/{id}",
      "kind": "GET_ONE",
      "content_ref": "compute_audit_log_calculate_team_bonus_pool",
      "required_scope": "hr.manage",
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Employee Directory",
      "slug": "employee_directory",
      "role": "employee",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "employees",
            "columns": [
              {
                "field": "name",
                "label": "name"
              },
              {
                "field": "department",
                "label": "department"
              },
              {
                "field": "role",
                "label": "role"
              },
              {
                "field": "start_date",
                "label": "start date"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "search",
              "props": {
                "fields": [
                  "name",
                  "department"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Team Overview",
      "slug": "team_overview",
      "role": "manager",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "employees",
            "columns": [
              {
                "field": "name",
                "label": "name"
              },
              {
                "field": "department",
                "label": "department"
              },
              {
                "field": "role",
                "label": "role"
              },
              {
                "field": "start_date",
                "label": "start date"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": []
        },
        {
          "type": "stat_breakdown",
          "props": {
            "source": "employees",
            "label": "employees by department",
            "group_by": "department"
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    },
    {
      "name": "HR Dashboard",
      "slug": "hr_dashboard",
      "role": "hr business partner",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "employees",
            "columns": [
              {
                "field": "name",
                "label": "name"
              },
              {
                "field": "department",
                "label": "department"
              },
              {
                "field": "role",
                "label": "role"
              },
              {
                "field": "salary",
                "label": "salary"
              },
              {
                "field": "bonus_rate",
                "label": "bonus rate"
              },
              {
                "field": "start_date",
                "label": "start date"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "highlight",
              "props": {
                "condition": {
                  "value": "salary > 150000",
                  "is_expr": true
                }
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "department",
                "mode": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "search",
              "props": {
                "fields": [
                  "name"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Add Employee",
      "slug": "add_employee",
      "role": "hr business partner",
      "required_scope": "employees.manage",
      "children": [
        {
          "type": "form",
          "props": {
            "target": "employees",
            "submit_scope": "employees.manage"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "name",
                "label": "name",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "department",
                "label": "department",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "role",
                "label": "role",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "start_date",
                "label": "start date",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "salary",
                "label": "salary",
                "input_type": "currency",
                "step": "0.01"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "bonus_rate",
                "label": "bonus rate",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "ssn",
                "label": "ssn",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "phone",
                "label": "phone",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Salary Reviews",
      "slug": "salary_reviews",
      "role": "hr business partner",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "salary_reviews",
            "columns": [
              {
                "field": "employee",
                "label": "employee"
              },
              {
                "field": "review_date",
                "label": "review date"
              },
              {
                "field": "old_salary",
                "label": "old salary"
              },
              {
                "field": "new_salary",
                "label": "new salary"
              },
              {
                "field": "reason",
                "label": "reason"
              },
              {
                "field": "status",
                "label": "status"
              },
              {
                "field": "approved_by",
                "label": "approved by"
              }
            ],
            "row_actions": [
              {
                "type": "action_button",
                "props": {
                  "label": "Approve",
                  "action": "transition",
                  "target_state": "approved",
                  "visible_when": {
                    "value": ".state.canTransition('approved')",
                    "is_expr": true
                  },
                  "unavailable_behavior": "disable"
                },
                "style": {},
                "layout": {},
                "children": []
              },
              {
                "type": "action_button",
                "props": {
                  "label": "Apply",
                  "action": "transition",
                  "target_state": "applied",
                  "visible_when": {
                    "value": ".state.canTransition('applied')",
                    "is_expr": true
                  },
                  "unavailable_behavior": "disable"
                },
                "style": {},
                "layout": {},
                "children": []
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "status",
                "mode": "state",
                "options": [
                  "pending",
                  "approved",
                  "applied"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Directory",
      "page_slug": "employee_directory",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    },
    {
      "label": "Team",
      "page_slug": "team_overview",
      "visible_to": [
        "manager",
        "executive"
      ],
      "badge_content": null
    },
    {
      "label": "HR Dashboard",
      "page_slug": "hr_dashboard",
      "visible_to": [
        "hr business partner"
      ],
      "badge_content": null
    },
    {
      "label": "Add Employee",
      "page_slug": "add_employee",
      "visible_to": [
        "hr business partner"
      ],
      "badge_content": null
    },
    {
      "label": "Salary Reviews",
      "page_slug": "salary_reviews",
      "visible_to": [
        "hr business partner"
      ],
      "badge_content": null
    }
  ],
  "streams": [
    {
      "description": "employee updates",
      "path": "/api/v1/stream"
    }
  ],
  "computes": [
    {
      "name": {
        "display": "Calculate Team Bonus Pool",
        "snake": "calculate_team_bonus_pool",
        "pascal": "CalculateTeamBonusPool"
      },
      "shape": "REDUCE",
      "input_content": [
        "employees"
      ],
      "output_content": [
        "employees"
      ],
      "body_lines": [
        "team_bonus = sum(employees.salary * employees.bonus_rate)"
      ],
      "required_scope": "team_metrics.view",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "service",
      "required_confidentiality_scopes": [
        "salary.access"
      ],
      "output_confidentiality_scope": "team_metrics.view",
      "field_dependencies": [
        {
          "content_name": "employees",
          "field_name": "salary",
          "confidentiality_scopes": [
            "salary.access"
          ]
        },
        {
          "content_name": "employees",
          "field_name": "bonus_rate",
          "confidentiality_scopes": [
            "salary.access"
          ]
        }
      ],
      "provider": null,
      "preconditions": [],
      "postconditions": [],
      "directive": null,
      "objective": null,
      "strategy": null,
      "trigger": null,
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "actions",
      "audit_scope": "hr.manage",
      "audit_content_ref": "compute_audit_log_calculate_team_bonus_pool"
    }
  ],
  "channels": [],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": [
    {
      "compute_name": "Calculate Team Bonus Pool",
      "input_scopes": [
        "salary.access"
      ],
      "output_scope": "team_metrics.view"
    }
  ]
}