{
  "ir_version": "0.4.0",
  "reflection_enabled": true,
  "app_id": "98883884-b402-42a0-858f-20defd9f1184",
  "name": "Project Management Board",
  "description": "Track projects, sprints, and tasks from backlog to done",
  "auth": {
    "provider": "stub",
    "scopes": [
      "projects.view",
      "tasks.manage",
      "sprints.manage",
      "projects.admin"
    ],
    "roles": [
      {
        "name": "developer",
        "scopes": [
          "projects.view",
          "tasks.manage"
        ]
      },
      {
        "name": "project manager",
        "scopes": [
          "projects.view",
          "tasks.manage",
          "sprints.manage",
          "projects.admin"
        ]
      },
      {
        "name": "stakeholder",
        "scopes": [
          "projects.view"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "projects",
        "snake": "projects",
        "pascal": "Projects"
      },
      "fields": [
        {
          "name": "name",
          "display_name": "name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": true,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "description",
          "display_name": "description",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "status",
          "display_name": "status",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "active",
            "on hold",
            "completed"
          ],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": []
    },
    {
      "name": {
        "display": "team members",
        "snake": "team_members",
        "pascal": "TeamMembers"
      },
      "fields": [
        {
          "name": "name",
          "display_name": "name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "email",
          "display_name": "email",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": true,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "role",
          "display_name": "role",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "developer",
            "designer",
            "qa",
            "devops"
          ],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "project",
          "display_name": "project",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "projects",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": []
    },
    {
      "name": {
        "display": "sprints",
        "snake": "sprints",
        "pascal": "Sprints"
      },
      "fields": [
        {
          "name": "name",
          "display_name": "name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "project",
          "display_name": "project",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "projects",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "goal",
          "display_name": "goal",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "capacity",
          "display_name": "capacity",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": 0,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": []
    },
    {
      "name": {
        "display": "tasks",
        "snake": "tasks",
        "pascal": "Tasks"
      },
      "fields": [
        {
          "name": "title",
          "display_name": "title",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "description",
          "display_name": "description",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "project",
          "display_name": "project",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "projects",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "sprint",
          "display_name": "sprint",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "sprints",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "assignee",
          "display_name": "assignee",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "team_members",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "points",
          "display_name": "points",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": 0,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "priority",
          "display_name": "priority",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "low",
            "medium",
            "high",
            "critical"
          ],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": true,
      "initial_state": "backlog",
      "confidentiality_scopes": []
    },
    {
      "name": {
        "display": "time logs",
        "snake": "time_logs",
        "pascal": "TimeLogs"
      },
      "fields": [
        {
          "name": "task",
          "display_name": "task",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "tasks",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "team_member",
          "display_name": "team member",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "team_members",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "hours",
          "display_name": "hours",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "logged_at",
          "display_name": "logged at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": []
    }
  ],
  "access_grants": [
    {
      "content": "projects",
      "scope": "projects.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "projects",
      "scope": "projects.admin",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "projects",
      "scope": "projects.admin",
      "verbs": [
        "DELETE"
      ]
    },
    {
      "content": "team_members",
      "scope": "projects.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "team_members",
      "scope": "projects.admin",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "sprints",
      "scope": "projects.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "sprints",
      "scope": "sprints.manage",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "tasks",
      "scope": "projects.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "tasks",
      "scope": "tasks.manage",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "tasks",
      "scope": "projects.admin",
      "verbs": [
        "DELETE"
      ]
    },
    {
      "content": "time_logs",
      "scope": "projects.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "time_logs",
      "scope": "tasks.manage",
      "verbs": [
        "CREATE"
      ]
    }
  ],
  "state_machines": [
    {
      "content_ref": "tasks",
      "machine_name": "task lifecycle",
      "initial_state": "backlog",
      "states": [
        "backlog",
        "in sprint",
        "in progress",
        "in review",
        "done"
      ],
      "transitions": [
        {
          "from_state": "backlog",
          "to_state": "in sprint",
          "required_scope": "sprints.manage"
        },
        {
          "from_state": "in sprint",
          "to_state": "in progress",
          "required_scope": "tasks.manage"
        },
        {
          "from_state": "in progress",
          "to_state": "in review",
          "required_scope": "tasks.manage"
        },
        {
          "from_state": "in review",
          "to_state": "done",
          "required_scope": "tasks.manage"
        },
        {
          "from_state": "in review",
          "to_state": "in progress",
          "required_scope": "tasks.manage"
        },
        {
          "from_state": "done",
          "to_state": "in progress",
          "required_scope": "tasks.manage"
        }
      ],
      "primitive_type": "content"
    }
  ],
  "events": [],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/projects",
      "kind": "LIST",
      "content_ref": "projects",
      "required_scope": "projects.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/projects",
      "kind": "CREATE",
      "content_ref": "projects",
      "required_scope": "projects.admin",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/projects/{id}",
      "kind": "GET_ONE",
      "content_ref": "projects",
      "required_scope": "projects.view",
      "lookup_column": "name",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/projects/{id}",
      "kind": "UPDATE",
      "content_ref": "projects",
      "required_scope": "projects.admin",
      "lookup_column": "name",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/projects/{id}",
      "kind": "DELETE",
      "content_ref": "projects",
      "required_scope": "projects.admin",
      "lookup_column": "name",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/team-members",
      "kind": "LIST",
      "content_ref": "team_members",
      "required_scope": "projects.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/team-members",
      "kind": "CREATE",
      "content_ref": "team_members",
      "required_scope": "projects.admin",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/sprints",
      "kind": "LIST",
      "content_ref": "sprints",
      "required_scope": "projects.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/sprints",
      "kind": "CREATE",
      "content_ref": "sprints",
      "required_scope": "sprints.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/sprints/{id}",
      "kind": "UPDATE",
      "content_ref": "sprints",
      "required_scope": "sprints.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/tasks",
      "kind": "LIST",
      "content_ref": "tasks",
      "required_scope": "projects.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/tasks",
      "kind": "CREATE",
      "content_ref": "tasks",
      "required_scope": "tasks.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/tasks/{id}",
      "kind": "GET_ONE",
      "content_ref": "tasks",
      "required_scope": "projects.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/tasks/{id}",
      "kind": "UPDATE",
      "content_ref": "tasks",
      "required_scope": "tasks.manage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/tasks/{id}",
      "kind": "DELETE",
      "content_ref": "tasks",
      "required_scope": "projects.admin",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/tasks/{id}/plan",
      "kind": "TRANSITION",
      "content_ref": "tasks",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "in sprint"
    },
    {
      "method": "POST",
      "path": "/api/v1/tasks/{id}/start",
      "kind": "TRANSITION",
      "content_ref": "tasks",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "in progress"
    },
    {
      "method": "POST",
      "path": "/api/v1/tasks/{id}/review",
      "kind": "TRANSITION",
      "content_ref": "tasks",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "in review"
    },
    {
      "method": "POST",
      "path": "/api/v1/tasks/{id}/complete",
      "kind": "TRANSITION",
      "content_ref": "tasks",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "done"
    },
    {
      "method": "POST",
      "path": "/api/v1/tasks/{id}/rework",
      "kind": "TRANSITION",
      "content_ref": "tasks",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "in progress"
    },
    {
      "method": "GET",
      "path": "/api/v1/time-logs",
      "kind": "LIST",
      "content_ref": "time_logs",
      "required_scope": "projects.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/time-logs",
      "kind": "CREATE",
      "content_ref": "time_logs",
      "required_scope": "tasks.manage",
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Sprint Board",
      "slug": "sprint_board",
      "role": "developer",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "tasks",
            "columns": [
              {
                "field": "title",
                "label": "title"
              },
              {
                "field": "priority",
                "label": "priority"
              },
              {
                "field": "status",
                "label": "status"
              },
              {
                "field": "assignee",
                "label": "assignee"
              },
              {
                "field": "points",
                "label": "points"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "status",
                "mode": "state",
                "options": [
                  "backlog",
                  "in sprint",
                  "in progress",
                  "in review",
                  "done"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "priority",
                "mode": "enum",
                "options": [
                  "low",
                  "medium",
                  "high",
                  "critical"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "sprint",
                "mode": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "search",
              "props": {
                "fields": [
                  "title"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "subscribe",
              "props": {
                "content": "tasks"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Log Time",
      "slug": "log_time",
      "role": "developer",
      "required_scope": "tasks.manage",
      "children": [
        {
          "type": "form",
          "props": {
            "target": "time_logs",
            "submit_scope": "tasks.manage"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "task",
                "label": "task",
                "input_type": "reference",
                "required": true,
                "reference_content": "tasks",
                "reference_display_col": "title"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "team_member",
                "label": "team member",
                "input_type": "reference",
                "required": true,
                "reference_content": "team_members",
                "reference_display_col": "name",
                "reference_unique_col": "email"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "hours",
                "label": "hours",
                "input_type": "currency",
                "step": "0.01"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Create Task",
      "slug": "create_task",
      "role": "project manager",
      "required_scope": "tasks.manage",
      "children": [
        {
          "type": "form",
          "props": {
            "target": "tasks",
            "submit_scope": "tasks.manage"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "title",
                "label": "title",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "description",
                "label": "description",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "project",
                "label": "project",
                "input_type": "reference",
                "required": true,
                "reference_content": "projects",
                "reference_display_col": "name",
                "reference_unique_col": "name"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "sprint",
                "label": "sprint",
                "input_type": "reference",
                "reference_content": "sprints",
                "reference_display_col": "name"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "assignee",
                "label": "assignee",
                "input_type": "reference",
                "reference_content": "team_members",
                "reference_display_col": "name",
                "reference_unique_col": "email"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "points",
                "label": "points",
                "input_type": "number",
                "minimum": 0
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "priority",
                "label": "priority",
                "input_type": "enum",
                "enum_values": [
                  "low",
                  "medium",
                  "high",
                  "critical"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Project Dashboard",
      "slug": "project_dashboard",
      "role": "project manager",
      "required_scope": null,
      "children": [
        {
          "type": "stat_breakdown",
          "props": {
            "source": "tasks",
            "label": "total task count with backlog vs done breakdown",
            "group_by": "status"
          },
          "style": {},
          "layout": {},
          "children": []
        },
        {
          "type": "aggregation",
          "props": {
            "source": "time_logs",
            "label": "total time logged `sum(hours)`",
            "agg_type": "sum"
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    },
    {
      "name": "New Project",
      "slug": "new_project",
      "role": "project manager",
      "required_scope": "projects.admin",
      "children": [
        {
          "type": "form",
          "props": {
            "target": "projects",
            "submit_scope": "projects.admin"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "name",
                "label": "name",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "description",
                "label": "description",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "status",
                "label": "status",
                "input_type": "enum",
                "enum_values": [
                  "active",
                  "on hold",
                  "completed"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Sprint Planning",
      "slug": "sprint_planning",
      "role": "project manager",
      "required_scope": "sprints.manage",
      "children": [
        {
          "type": "form",
          "props": {
            "target": "sprints",
            "submit_scope": "sprints.manage"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "name",
                "label": "name",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "project",
                "label": "project",
                "input_type": "reference",
                "required": true,
                "reference_content": "projects",
                "reference_display_col": "name",
                "reference_unique_col": "name"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "goal",
                "label": "goal",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "capacity",
                "label": "capacity",
                "input_type": "number",
                "minimum": 0
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Team Management",
      "slug": "team_management",
      "role": "project manager",
      "required_scope": "projects.admin",
      "children": [
        {
          "type": "form",
          "props": {
            "target": "team_members",
            "submit_scope": "projects.admin"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "name",
                "label": "name",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "email",
                "label": "email",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "role",
                "label": "role",
                "input_type": "enum",
                "enum_values": [
                  "developer",
                  "designer",
                  "qa",
                  "devops"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "project",
                "label": "project",
                "input_type": "reference",
                "required": true,
                "reference_content": "projects",
                "reference_display_col": "name",
                "reference_unique_col": "name"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Board",
      "page_slug": "sprint_board",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    },
    {
      "label": "New Project",
      "page_slug": "new_project",
      "visible_to": [
        "project manager"
      ],
      "badge_content": null
    },
    {
      "label": "Create Task",
      "page_slug": "create_task",
      "visible_to": [
        "developer",
        "project manager"
      ],
      "badge_content": null
    },
    {
      "label": "Log Time",
      "page_slug": "log_time",
      "visible_to": [
        "developer"
      ],
      "badge_content": null
    },
    {
      "label": "Sprint Planning",
      "page_slug": "sprint_planning",
      "visible_to": [
        "project manager"
      ],
      "badge_content": null
    },
    {
      "label": "Team",
      "page_slug": "team_management",
      "visible_to": [
        "project manager"
      ],
      "badge_content": null
    },
    {
      "label": "Dashboard",
      "page_slug": "project_dashboard",
      "visible_to": [
        "project manager",
        "stakeholder"
      ],
      "badge_content": null
    }
  ],
  "streams": [
    {
      "description": "task updates",
      "path": "/api/v1/stream"
    }
  ],
  "computes": [],
  "channels": [],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}