{
  "ir_version": "0.8.0",
  "reflection_enabled": true,
  "app_id": "33902654-92f7-460e-9002-64e0a5a07d16",
  "name": "Security Agent",
  "description": "Autonomous agent that patrols the app fabric for security issues, auto-remediates safe fixes, and escalates findings that require human judgment",
  "auth": {
    "provider": "midway",
    "scopes": [
      "findings.view",
      "findings.triage",
      "findings.remediate",
      "alerts.send"
    ],
    "roles": [
      {
        "name": "platform engineer",
        "scopes": [
          "findings.view",
          "findings.triage",
          "findings.remediate",
          "alerts.send"
        ]
      },
      {
        "name": "security reviewer",
        "scopes": [
          "findings.view",
          "findings.triage"
        ]
      },
      {
        "name": "app owner",
        "scopes": [
          "findings.view"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "findings",
        "snake": "findings",
        "pascal": "Findings"
      },
      "fields": [
        {
          "name": "app_name",
          "display_name": "app name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "finding_type",
          "display_name": "finding type",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "iam-drift",
            "cve",
            "confidentiality-violation",
            "stale-secret",
            "state-deadlock",
            "error-spike"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "severity",
          "display_name": "severity",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "critical",
            "high",
            "medium",
            "low"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "summary",
          "display_name": "summary",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "details",
          "display_name": "details",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "affected_resource",
          "display_name": "affected resource",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "detected_at",
          "display_name": "detected at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "remediation_action",
          "display_name": "remediation action",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "finding",
      "storage_intent": "auto",
      "has_state_machine": true,
      "initial_state": "detected",
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "scan runs",
        "snake": "scan_runs",
        "pascal": "ScanRuns"
      },
      "fields": [
        {
          "name": "scan_type",
          "display_name": "scan type",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "iam-audit",
            "cve-scan",
            "confidentiality-check",
            "secret-rotation-check"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "apps_scanned",
          "display_name": "apps scanned",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "findings_count",
          "display_name": "findings count",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "status",
          "display_name": "status",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "running",
            "completed",
            "failed"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "scan_run",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "actions",
      "dependent_values": []
    },
    {
      "name": {
        "display": "compute audit log scanner",
        "snake": "compute_audit_log_scanner",
        "pascal": "ComputeAuditLogScanner"
      },
      "fields": [
        {
          "name": "compute_name",
          "display_name": "compute name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "invocation_id",
          "display_name": "invocation id",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trigger",
          "display_name": "trigger",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "completed_at",
          "display_name": "completed at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "duration_ms",
          "display_name": "duration ms",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "outcome",
          "display_name": "outcome",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "success",
            "error",
            "timeout",
            "cancelled"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_input_tokens",
          "display_name": "total input tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_output_tokens",
          "display_name": "total output tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trace",
          "display_name": "trace",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "error_message",
          "display_name": "error message",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "compute_audit_log_scanner",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "none",
      "dependent_values": []
    },
    {
      "name": {
        "display": "compute audit log remediator",
        "snake": "compute_audit_log_remediator",
        "pascal": "ComputeAuditLogRemediator"
      },
      "fields": [
        {
          "name": "compute_name",
          "display_name": "compute name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "invocation_id",
          "display_name": "invocation id",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trigger",
          "display_name": "trigger",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "completed_at",
          "display_name": "completed at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "duration_ms",
          "display_name": "duration ms",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "outcome",
          "display_name": "outcome",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "success",
            "error",
            "timeout",
            "cancelled"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_input_tokens",
          "display_name": "total input tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_output_tokens",
          "display_name": "total output tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trace",
          "display_name": "trace",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "error_message",
          "display_name": "error message",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "compute_audit_log_remediator",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "none",
      "dependent_values": []
    }
  ],
  "access_grants": [
    {
      "content": "findings",
      "scope": "findings.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "findings",
      "scope": "findings.triage",
      "verbs": [
        "CREATE"
      ]
    },
    {
      "content": "findings",
      "scope": "findings.remediate",
      "verbs": [
        "DELETE",
        "UPDATE"
      ]
    },
    {
      "content": "scan_runs",
      "scope": "findings.view",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "scan_runs",
      "scope": "findings.triage",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "compute_audit_log_scanner",
      "scope": "findings.remediate",
      "verbs": [
        "AUDIT"
      ]
    },
    {
      "content": "compute_audit_log_scanner",
      "scope": "findings.remediate",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "compute_audit_log_remediator",
      "scope": "findings.remediate",
      "verbs": [
        "AUDIT"
      ]
    },
    {
      "content": "compute_audit_log_remediator",
      "scope": "findings.remediate",
      "verbs": [
        "VIEW"
      ]
    }
  ],
  "state_machines": [
    {
      "content_ref": "findings",
      "machine_name": "remediation",
      "initial_state": "detected",
      "states": [
        "detected",
        "analyzing",
        "auto-fix-applied",
        "verified",
        "flagged-for-human",
        "closed"
      ],
      "transitions": [
        {
          "from_state": "detected",
          "to_state": "analyzing",
          "required_scope": "findings.triage",
          "feedback": []
        },
        {
          "from_state": "analyzing",
          "to_state": "auto-fix-applied",
          "required_scope": "findings.remediate",
          "feedback": []
        },
        {
          "from_state": "analyzing",
          "to_state": "flagged-for-human",
          "required_scope": "findings.triage",
          "feedback": []
        },
        {
          "from_state": "auto-fix-applied",
          "to_state": "verified",
          "required_scope": "findings.remediate",
          "feedback": []
        },
        {
          "from_state": "auto-fix-applied",
          "to_state": "flagged-for-human",
          "required_scope": "findings.triage",
          "feedback": []
        },
        {
          "from_state": "verified",
          "to_state": "closed",
          "required_scope": "findings.triage",
          "feedback": []
        },
        {
          "from_state": "flagged-for-human",
          "to_state": "closed",
          "required_scope": "findings.remediate",
          "feedback": []
        }
      ],
      "primitive_type": "content"
    }
  ],
  "events": [
    {
      "source_content": "findings",
      "trigger": "expr",
      "condition": null,
      "action": {
        "target_content": "",
        "column_mapping": [],
        "send_content": "finding",
        "send_channel": "slack"
      },
      "condition_expr": "finding.remediation.enters(\"flagged-for-human\")",
      "log_level": "INFO"
    },
    {
      "source_content": "findings",
      "trigger": "expr",
      "condition": null,
      "action": {
        "target_content": "",
        "column_mapping": [],
        "send_content": "finding",
        "send_channel": "slack"
      },
      "condition_expr": "finding.created && finding.severity == \"critical\"",
      "log_level": "WARN"
    }
  ],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/findings",
      "kind": "LIST",
      "content_ref": "findings",
      "required_scope": "findings.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/findings",
      "kind": "CREATE",
      "content_ref": "findings",
      "required_scope": "findings.triage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/findings/{id}",
      "kind": "GET_ONE",
      "content_ref": "findings",
      "required_scope": "findings.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/findings/{id}",
      "kind": "UPDATE",
      "content_ref": "findings",
      "required_scope": "findings.remediate",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/findings/{id}",
      "kind": "DELETE",
      "content_ref": "findings",
      "required_scope": "findings.remediate",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/findings/{id}/_transition/analyzing",
      "kind": "TRANSITION",
      "content_ref": "findings",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "analyzing"
    },
    {
      "method": "POST",
      "path": "/api/v1/findings/{id}/_transition/auto-fix-applied",
      "kind": "TRANSITION",
      "content_ref": "findings",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "auto-fix-applied"
    },
    {
      "method": "POST",
      "path": "/api/v1/findings/{id}/_transition/flagged-for-human",
      "kind": "TRANSITION",
      "content_ref": "findings",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "flagged-for-human"
    },
    {
      "method": "POST",
      "path": "/api/v1/findings/{id}/_transition/verified",
      "kind": "TRANSITION",
      "content_ref": "findings",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "verified"
    },
    {
      "method": "POST",
      "path": "/api/v1/findings/{id}/_transition/closed",
      "kind": "TRANSITION",
      "content_ref": "findings",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": "closed"
    },
    {
      "method": "GET",
      "path": "/api/v1/scan_runs",
      "kind": "LIST",
      "content_ref": "scan_runs",
      "required_scope": "findings.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/scan_runs",
      "kind": "CREATE",
      "content_ref": "scan_runs",
      "required_scope": "findings.triage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/scan_runs/{id}",
      "kind": "GET_ONE",
      "content_ref": "scan_runs",
      "required_scope": "findings.view",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/scan_runs/{id}",
      "kind": "UPDATE",
      "content_ref": "scan_runs",
      "required_scope": "findings.triage",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/scan_runs/{id}",
      "kind": "DELETE",
      "content_ref": "scan_runs",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_scanner",
      "kind": "LIST",
      "content_ref": "compute_audit_log_scanner",
      "required_scope": "findings.remediate",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_scanner/{id}",
      "kind": "GET_ONE",
      "content_ref": "compute_audit_log_scanner",
      "required_scope": "findings.remediate",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_remediator",
      "kind": "LIST",
      "content_ref": "compute_audit_log_remediator",
      "required_scope": "findings.remediate",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_remediator/{id}",
      "kind": "GET_ONE",
      "content_ref": "compute_audit_log_remediator",
      "required_scope": "findings.remediate",
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Security Dashboard",
      "slug": "security_dashboard",
      "role": "platform engineer",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "findings",
            "columns": [
              {
                "field": "app_name",
                "label": "app name"
              },
              {
                "field": "finding_type",
                "label": "finding type"
              },
              {
                "field": "severity",
                "label": "severity"
              },
              {
                "field": "remediation",
                "label": "remediation"
              },
              {
                "field": "detected_at",
                "label": "detected at"
              },
              {
                "field": "remediation_action",
                "label": "remediation action"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "finding_type",
                "mode": "enum",
                "options": [
                  "iam-drift",
                  "cve",
                  "confidentiality-violation",
                  "stale-secret",
                  "state-deadlock",
                  "error-spike"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "severity",
                "mode": "enum",
                "options": [
                  "critical",
                  "high",
                  "medium",
                  "low"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "remediation",
                "mode": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "subscribe",
              "props": {
                "content": "findings"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        },
        {
          "type": "stat_breakdown",
          "props": {
            "source": "findings",
            "label": "findings by severity",
            "group_by": "severity"
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    },
    {
      "name": "Review Queue",
      "slug": "review_queue",
      "role": "security reviewer",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "findings",
            "columns": [
              {
                "field": "app_name",
                "label": "app name"
              },
              {
                "field": "finding_type",
                "label": "finding type"
              },
              {
                "field": "severity",
                "label": "severity"
              },
              {
                "field": "summary",
                "label": "summary"
              },
              {
                "field": "details",
                "label": "details"
              },
              {
                "field": "remediation_action",
                "label": "remediation action"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "finding_type_and_severity",
                "mode": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "My Apps",
      "slug": "my_apps",
      "role": "app owner",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "findings",
            "columns": [
              {
                "field": "finding_type",
                "label": "finding type"
              },
              {
                "field": "severity",
                "label": "severity"
              },
              {
                "field": "remediation",
                "label": "remediation"
              },
              {
                "field": "summary",
                "label": "summary"
              },
              {
                "field": "detected_at",
                "label": "detected at"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "finding_type_and_severity",
                "mode": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Dashboard",
      "page_slug": "security_dashboard",
      "visible_to": [
        "platform engineer"
      ],
      "badge_content": null
    },
    {
      "label": "Review",
      "page_slug": "review_queue",
      "visible_to": [
        "platform engineer",
        "security reviewer"
      ],
      "badge_content": null
    },
    {
      "label": "My Apps",
      "page_slug": "my_apps",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    }
  ],
  "streams": [],
  "computes": [
    {
      "name": {
        "display": "scanner",
        "snake": "scanner",
        "pascal": "Scanner"
      },
      "shape": "TRANSFORM",
      "input_content": [
        "findings"
      ],
      "output_content": [
        "findings"
      ],
      "body_lines": [],
      "required_scope": "findings.remediate",
      "required_role": null,
      "input_params": [],
      "output_params": [],
      "client_safe": false,
      "identity_mode": "service",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": "ai-agent",
      "preconditions": [
        "Compute.Scopes.contains(\"findings.triage\")"
      ],
      "postconditions": [
        "After.content_query(\"findings\").size() <= Before.content_query(\"findings\").size() + 100"
      ],
      "directive": null,
      "objective": "You are a security scanning agent for the app fabric.\n    Scan all deployed apps for IAM policy drift, dependency CVEs,\n    confidentiality violations, and stale secrets. Create a finding\n    for each issue detected. Prioritize internet-facing apps over\n    internal, production over beta.",
      "strategy": "1. Use reflect.apps() to list all active apps\n    2. For each app:\n       a. Use reflect.app(name).definition to load its definition\n       b. Use channel.invoke(\"security-tools\", \"describe-iam-policy\") to get current policy\n       c. Compare expected vs actual IAM policy\n       d. Check dependency CVEs and secret rotation age\n    3. Use content.create(\"findings\", ...) for each issue found\n    4. Use content.create(\"scan-runs\", ...) to record this execution",
      "trigger": "schedule every 1 hour",
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "debug",
      "audit_scope": "findings.remediate",
      "audit_content_ref": "compute_audit_log_scanner"
    },
    {
      "name": {
        "display": "remediator",
        "snake": "remediator",
        "pascal": "Remediator"
      },
      "shape": "TRANSFORM",
      "input_content": [
        "findings"
      ],
      "output_content": [
        "findings"
      ],
      "body_lines": [],
      "required_scope": "findings.remediate",
      "required_role": null,
      "input_params": [
        {
          "name": "finding",
          "type_name": "findings"
        }
      ],
      "output_params": [
        {
          "name": "finding",
          "type_name": "findings"
        }
      ],
      "client_safe": false,
      "identity_mode": "service",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": "ai-agent",
      "preconditions": [
        "Compute.Scopes.contains(\"findings.remediate\")"
      ],
      "postconditions": [
        "After.content_query(\"findings\").filter(f, f.remediation == \"detected\").size() <= Before.content_query(\"findings\").filter(f, f.remediation == \"detected\").size()"
      ],
      "directive": null,
      "objective": "You are a remediation agent. Attempt safe auto-remediation for\n    security findings. Only act where the fix is deterministic and\n    reversible. Flag for human review if judgment is needed.",
      "strategy": "1. Read the finding and classify:\n       - iam-drift: use channel.invoke(\"security-tools\", \"restrict-policy\")\n         to narrow the IAM policy to expected permissions\n       - stale-secret: use channel.invoke(\"security-tools\", \"rotate-secret\")\n         to rotate the expired credential\n       - confidentiality-violation: flag for human (requires definition change)\n       - cve, state-deadlock, error-spike: flag for human\n    2. For auto-remediable: state.transition(finding, \"auto-fix-applied\")\n    3. For human-required: state.transition(finding, \"flagged-for-human\")",
      "trigger": "event \"finding.created\"",
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "debug",
      "audit_scope": "findings.remediate",
      "audit_content_ref": "compute_audit_log_remediator"
    }
  ],
  "channels": [
    {
      "name": {
        "display": "security-tools",
        "snake": "security_tools",
        "pascal": "SecurityTools"
      },
      "carries_content": "",
      "direction": "OUTBOUND",
      "delivery": "RELIABLE",
      "endpoint": null,
      "requirements": [],
      "actions": [
        {
          "name": {
            "display": "restrict-policy",
            "snake": "restrict_policy",
            "pascal": "RestrictPolicy"
          },
          "takes": [
            {
              "name": "role",
              "param_type": "text"
            },
            {
              "name": "policy",
              "param_type": "text"
            }
          ],
          "returns": [
            {
              "name": "result",
              "param_type": "text"
            }
          ],
          "required_scopes": [
            "findings.remediate"
          ]
        },
        {
          "name": {
            "display": "rotate-secret",
            "snake": "rotate_secret",
            "pascal": "RotateSecret"
          },
          "takes": [
            {
              "name": "arn",
              "param_type": "text"
            }
          ],
          "returns": [
            {
              "name": "confirmation",
              "param_type": "text"
            }
          ],
          "required_scopes": [
            "findings.remediate"
          ]
        },
        {
          "name": {
            "display": "describe-iam-policy",
            "snake": "describe_iam_policy",
            "pascal": "DescribeIamPolicy"
          },
          "takes": [
            {
              "name": "role",
              "param_type": "text"
            }
          ],
          "returns": [
            {
              "name": "policy",
              "param_type": "text"
            }
          ],
          "required_scopes": [
            "findings.view"
          ]
        }
      ]
    },
    {
      "name": {
        "display": "slack",
        "snake": "slack",
        "pascal": "Slack"
      },
      "carries_content": "findings",
      "direction": "BIDIRECTIONAL",
      "delivery": "REALTIME",
      "endpoint": null,
      "requirements": [
        {
          "scope": "alerts.send",
          "direction": "send"
        }
      ],
      "actions": [
        {
          "name": {
            "display": "post-message",
            "snake": "post_message",
            "pascal": "PostMessage"
          },
          "takes": [
            {
              "name": "channel id",
              "param_type": "text"
            },
            {
              "name": "text",
              "param_type": "text"
            }
          ],
          "returns": [
            {
              "name": "ok",
              "param_type": "yes or no"
            }
          ],
          "required_scopes": [
            "alerts.send"
          ]
        }
      ]
    }
  ],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}