{
  "ir_version": "0.5.0",
  "reflection_enabled": true,
  "app_id": "3e157422-d10c-4a2b-b6c3-9f80fc80f27b",
  "name": "Warehouse Inventory Manager",
  "description": "Track products and stock levels across warehouses",
  "auth": {
    "provider": "stub",
    "scopes": [
      "inventory.read",
      "inventory.write",
      "inventory.admin"
    ],
    "roles": [
      {
        "name": "warehouse clerk",
        "scopes": [
          "inventory.read",
          "inventory.write"
        ]
      },
      {
        "name": "warehouse manager",
        "scopes": [
          "inventory.read",
          "inventory.write",
          "inventory.admin"
        ]
      },
      {
        "name": "executive",
        "scopes": [
          "inventory.read"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "products",
        "snake": "products",
        "pascal": "Products"
      },
      "fields": [
        {
          "name": "sku",
          "display_name": "SKU",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": true,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "name",
          "display_name": "name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "description",
          "display_name": "description",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "unit_cost",
          "display_name": "unit cost",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "category",
          "display_name": "category",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "raw material",
            "finished good",
            "packaging"
          ],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "product",
      "storage_intent": "auto",
      "has_state_machine": true,
      "initial_state": "draft",
      "confidentiality_scopes": []
    },
    {
      "name": {
        "display": "stock levels",
        "snake": "stock_levels",
        "pascal": "StockLevels"
      },
      "fields": [
        {
          "name": "product",
          "display_name": "product",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "products",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "warehouse",
          "display_name": "warehouse",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "quantity",
          "display_name": "quantity",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": 0,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "reorder_threshold",
          "display_name": "reorder threshold",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": 0,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "stock_level",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": []
    },
    {
      "name": {
        "display": "reorder alerts",
        "snake": "reorder_alerts",
        "pascal": "ReorderAlerts"
      },
      "fields": [
        {
          "name": "product",
          "display_name": "product",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "products",
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "warehouse",
          "display_name": "warehouse",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "current_quantity",
          "display_name": "current quantity",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "threshold",
          "display_name": "threshold",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "created_at",
          "display_name": "created at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "reorder_alert",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": []
    }
  ],
  "access_grants": [
    {
      "content": "products",
      "scope": "inventory.read",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "products",
      "scope": "inventory.write",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "products",
      "scope": "inventory.admin",
      "verbs": [
        "DELETE"
      ]
    },
    {
      "content": "stock_levels",
      "scope": "inventory.read",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "stock_levels",
      "scope": "inventory.write",
      "verbs": [
        "CREATE",
        "UPDATE"
      ]
    },
    {
      "content": "reorder_alerts",
      "scope": "inventory.read",
      "verbs": [
        "VIEW"
      ]
    },
    {
      "content": "reorder_alerts",
      "scope": "inventory.write",
      "verbs": [
        "CREATE"
      ]
    },
    {
      "content": "reorder_alerts",
      "scope": "inventory.admin",
      "verbs": [
        "UPDATE"
      ]
    }
  ],
  "state_machines": [
    {
      "content_ref": "products",
      "machine_name": "product lifecycle",
      "initial_state": "draft",
      "states": [
        "draft",
        "active",
        "discontinued"
      ],
      "transitions": [
        {
          "from_state": "draft",
          "to_state": "active",
          "required_scope": "inventory.write"
        },
        {
          "from_state": "active",
          "to_state": "discontinued",
          "required_scope": "inventory.admin"
        },
        {
          "from_state": "discontinued",
          "to_state": "active",
          "required_scope": "inventory.admin"
        }
      ],
      "primitive_type": "content"
    }
  ],
  "events": [
    {
      "source_content": "stock_levels",
      "trigger": "expr",
      "condition": null,
      "action": {
        "target_content": "reorder_alerts",
        "column_mapping": [
          [
            "product",
            "product"
          ],
          [
            "warehouse",
            "warehouse"
          ],
          [
            "current_quantity",
            "quantity"
          ],
          [
            "threshold",
            "reorder_threshold"
          ]
        ],
        "send_content": "",
        "send_channel": ""
      },
      "condition_expr": "stockLevel.updated && stockLevel.quantity <= stockLevel.reorderThreshold",
      "log_level": "INFO"
    }
  ],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/products",
      "kind": "LIST",
      "content_ref": "products",
      "required_scope": "inventory.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/products",
      "kind": "CREATE",
      "content_ref": "products",
      "required_scope": "inventory.write",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/products/{sku}",
      "kind": "GET_ONE",
      "content_ref": "products",
      "required_scope": "inventory.read",
      "lookup_column": "sku",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/products/{sku}",
      "kind": "UPDATE",
      "content_ref": "products",
      "required_scope": "inventory.write",
      "lookup_column": "sku",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/products/{sku}",
      "kind": "DELETE",
      "content_ref": "products",
      "required_scope": "inventory.admin",
      "lookup_column": "sku",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/products/{sku}/activate",
      "kind": "TRANSITION",
      "content_ref": "products",
      "required_scope": null,
      "lookup_column": "sku",
      "target_state": "active"
    },
    {
      "method": "POST",
      "path": "/api/v1/products/{sku}/discontinue",
      "kind": "TRANSITION",
      "content_ref": "products",
      "required_scope": null,
      "lookup_column": "sku",
      "target_state": "discontinued"
    },
    {
      "method": "GET",
      "path": "/api/v1/stock-levels",
      "kind": "LIST",
      "content_ref": "stock_levels",
      "required_scope": "inventory.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/stock-levels",
      "kind": "CREATE",
      "content_ref": "stock_levels",
      "required_scope": "inventory.write",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/stock-levels/{id}",
      "kind": "UPDATE",
      "content_ref": "stock_levels",
      "required_scope": "inventory.write",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/alerts",
      "kind": "LIST",
      "content_ref": "reorder_alerts",
      "required_scope": "inventory.read",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/alerts/{id}/acknowledge",
      "kind": "LIST",
      "content_ref": "reorder_alerts",
      "required_scope": "inventory.read",
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Inventory Dashboard",
      "slug": "inventory_dashboard",
      "role": "warehouse clerk",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "products",
            "columns": [
              {
                "field": "sku",
                "label": "SKU"
              },
              {
                "field": "name",
                "label": "name"
              },
              {
                "field": "category",
                "label": "category"
              },
              {
                "field": "status",
                "label": "status"
              }
            ],
            "row_actions": [
              {
                "type": "action_button",
                "props": {
                  "label": "Activate",
                  "action": "transition",
                  "target_state": "active",
                  "visible_when": {
                    "value": ".state.canTransition('active')",
                    "is_expr": true
                  },
                  "unavailable_behavior": "disable"
                },
                "style": {},
                "layout": {},
                "children": []
              },
              {
                "type": "action_button",
                "props": {
                  "label": "Discontinue",
                  "action": "transition",
                  "target_state": "discontinued",
                  "visible_when": {
                    "value": ".state.canTransition('discontinued')",
                    "is_expr": true
                  },
                  "unavailable_behavior": "disable"
                },
                "style": {},
                "layout": {},
                "children": []
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "related",
              "props": {
                "content": "stock_levels",
                "join": "product",
                "group_by": "warehouse"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "category",
                "mode": "enum",
                "options": [
                  "raw material",
                  "finished good",
                  "packaging"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "warehouse",
                "mode": "distinct"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "filter",
              "props": {
                "field": "status",
                "mode": "state",
                "options": [
                  "draft",
                  "active",
                  "discontinued"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "search",
              "props": {
                "fields": [
                  "sku",
                  "name"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "subscribe",
              "props": {
                "content": "stock_level"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Receive Stock",
      "slug": "receive_stock",
      "role": "warehouse clerk",
      "required_scope": "inventory.write",
      "children": [
        {
          "type": "form",
          "props": {
            "target": "stock_levels",
            "after_save": "return to the Inventory Dashboard",
            "submit_scope": "inventory.write"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "product",
                "label": "product",
                "input_type": "reference",
                "required": true,
                "reference_content": "products",
                "reference_display_col": "name",
                "reference_unique_col": "sku"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "warehouse",
                "label": "warehouse",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "quantity",
                "label": "quantity",
                "input_type": "number",
                "minimum": 0
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "reorder_threshold",
                "label": "reorder threshold",
                "input_type": "number",
                "minimum": 0
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Reorder Alerts",
      "slug": "reorder_alerts",
      "role": "warehouse clerk",
      "required_scope": null,
      "children": [
        {
          "type": "data_table",
          "props": {
            "source": "reorder_alerts",
            "columns": [
              {
                "field": "product",
                "label": "product"
              },
              {
                "field": "warehouse",
                "label": "warehouse"
              },
              {
                "field": "current_quantity",
                "label": "current quantity"
              },
              {
                "field": "threshold",
                "label": "threshold"
              },
              {
                "field": "created_at",
                "label": "created at"
              }
            ]
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "filter",
              "props": {
                "field": "warehouse",
                "mode": "distinct"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "subscribe",
              "props": {
                "content": "reorder_alerts"
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Add Product",
      "slug": "add_product",
      "role": "warehouse manager",
      "required_scope": "inventory.write",
      "children": [
        {
          "type": "form",
          "props": {
            "target": "products",
            "create_as": "draft",
            "after_save": "offer to set initial stock levels per warehouse",
            "submit_scope": "inventory.write"
          },
          "style": {},
          "layout": {},
          "children": [
            {
              "type": "field_input",
              "props": {
                "field": "sku",
                "label": "SKU",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "name",
                "label": "name",
                "input_type": "text",
                "required": true
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "description",
                "label": "description",
                "input_type": "text"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "unit_cost",
                "label": "unit cost",
                "input_type": "currency",
                "step": "0.01"
              },
              "style": {},
              "layout": {},
              "children": []
            },
            {
              "type": "field_input",
              "props": {
                "field": "category",
                "label": "category",
                "input_type": "enum",
                "enum_values": [
                  "raw material",
                  "finished good",
                  "packaging"
                ]
              },
              "style": {},
              "layout": {},
              "children": []
            }
          ]
        }
      ]
    },
    {
      "name": "Inventory Overview",
      "slug": "inventory_overview",
      "role": "executive",
      "required_scope": null,
      "children": [
        {
          "type": "stat_breakdown",
          "props": {
            "source": "products",
            "label": "total product count with active vs discontinued breakdown",
            "group_by": "status"
          },
          "style": {},
          "layout": {},
          "children": []
        },
        {
          "type": "chart",
          "props": {
            "source": "reorder_alerts",
            "chart_type": "line",
            "period_days": 30,
            "label": "reorder alerts (30 days)"
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    }
  ],
  "nav_items": [
    {
      "label": "Dashboard",
      "page_slug": "inventory_dashboard",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    },
    {
      "label": "Receive Stock",
      "page_slug": "receive_stock",
      "visible_to": [
        "clerk",
        "manager"
      ],
      "badge_content": null
    },
    {
      "label": "Alerts",
      "page_slug": "reorder_alerts",
      "visible_to": [
        "all"
      ],
      "badge_content": "reorder_alerts"
    },
    {
      "label": "Add Product",
      "page_slug": "add_product",
      "visible_to": [
        "manager"
      ],
      "badge_content": null
    },
    {
      "label": "Overview",
      "page_slug": "inventory_overview",
      "visible_to": [
        "executive"
      ],
      "badge_content": null
    }
  ],
  "streams": [
    {
      "description": "stock updates and alerts",
      "path": "/api/v1/stream"
    }
  ],
  "computes": [],
  "channels": [],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}